#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/imagebuilder/imagebuilder-staging/runs/run-68ep2VNwpypLhZL7

Waiting for the plan to start...

Terraform v0.14.0
Configuring remote state backend...
Initializing Terraform configuration...
aws_cloudwatch_log_group.internal_composer: Refreshing state... [id=internal_composer_staging]
aws_s3_bucket.imagebuilder_s3: Refreshing state... [id=imagebuilder.service.staging]
aws_iam_user.packer: Refreshing state... [id=packer_staging]
aws_iam_user.imagebuilder_worker: Refreshing state... [id=imagebuilder_worker_staging]
aws_cloudwatch_log_group.external_composer: Refreshing state... [id=external_composer_staging]
aws_iam_policy.spotfleet_iam_spot_policy: Refreshing state... [id=arn:aws:iam::933752197999:policy/spotfleet_iam_spot_policy_staging]
aws_iam_role.external_composer: Refreshing state... [id=external_composer_staging]
aws_iam_role.external_worker: Refreshing state... [id=external_worker_staging]
aws_iam_policy.vmimport_ec2: Refreshing state... [id=arn:aws:iam::933752197999:policy/vmimport_ec2_staging]
aws_iam_role.vmimport: Refreshing state... [id=vmimport_staging]
aws_iam_policy.vmimport_s3: Refreshing state... [id=arn:aws:iam::933752197999:policy/vmimport_s3_staging]
aws_cloudwatch_log_stream.internal_composer_syslog: Refreshing state... [id=internal_composer_syslog]
aws_iam_role.internal_composer: Refreshing state... [id=internal_composer_staging]
aws_iam_role.internal_worker: Refreshing state... [id=internal_worker_staging]
aws_iam_role.spot_fleet_tagging_role: Refreshing state... [id=imagebuilder_spot_fleet_role_staging]
aws_iam_policy.packer: Refreshing state... [id=arn:aws:iam::933752197999:policy/packer_staging]
aws_iam_instance_profile.external_composer: Refreshing state... [id=external_composer_staging]
aws_cloudwatch_log_stream.external_composer_syslog: Refreshing state... [id=external_composer_syslog]
aws_iam_policy.external_composer_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/external_composer_read_keys_staging]
aws_iam_instance_profile.external_worker: Refreshing state... [id=external_worker_staging]
aws_iam_policy.internal_worker_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_worker_read_keys_staging]
aws_iam_policy.external_worker_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/external_worker_read_keys_staging]
aws_iam_role_policy_attachment.vmimport_ec2: Refreshing state... [id=vmimport_staging-20201204204656576600000006]
aws_iam_user_policy_attachment.imagebuilder_vmimport: Refreshing state... [id=imagebuilder_worker_staging-20201204204656609900000007]
aws_iam_instance_profile.internal_worker: Refreshing state... [id=internal_worker_staging]
aws_iam_role_policy_attachment.vmimport_s3: Refreshing state... [id=vmimport_staging-20201204204656723700000009]
aws_iam_policy.internal_composer_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_composer_read_keys_staging]
aws_iam_instance_profile.internal_composer: Refreshing state... [id=internal_composer_staging]
aws_iam_role_policy_attachment.spotfleet_iam_role_policy: Refreshing state... [id=imagebuilder_spot_fleet_role_staging-20201204204656385800000003]
aws_iam_role_policy_attachment.spotfleet_iam_spot_policy: Refreshing state... [id=imagebuilder_spot_fleet_role_staging-20201204204656553800000004]
aws_iam_role_policy_attachment.external_composer_read_keys: Refreshing state... [id=external_composer_staging-20210113202541907800000001]
aws_iam_user_policy_attachment.packer: Refreshing state... [id=packer_staging-20201204204656365500000001]
aws_iam_policy.internal_cloudwatch_logging: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_cloudwatch_logging_staging]
aws_vpc_endpoint.external_vpc_s3: Refreshing state... [id=vpce-0249da6b762fae5de]
aws_security_group.external_workers: Refreshing state... [id=sg-0f578bf2872026f5d]
aws_security_group.external_vpc_endpoints: Refreshing state... [id=sg-0be443e4c92c98b1c]
aws_vpc_endpoint.internal_vpc_s3: Refreshing state... [id=vpce-08d5fdb7cd26e5c94]
aws_security_group.internal_allow_egress: Refreshing state... [id=sg-0eb65fd8f2c17dba5]
aws_security_group.internal_allow_trusted: Refreshing state... [id=sg-084607083aaa39727]
aws_iam_role_policy_attachment.external_worker_read_keys: Refreshing state... [id=external_worker_staging-20210113202541913700000002]
aws_iam_role_policy_attachment.internal_worker_read_keys: Refreshing state... [id=internal_worker_staging-20201204204656366800000002]
aws_iam_policy.external_cloudwatch_logging: Refreshing state... [id=arn:aws:iam::933752197999:policy/external_cloudwatch_logging_staging]
aws_iam_role_policy_attachment.internal_composer_read_keys: Refreshing state... [id=internal_composer_staging-20201204204656559200000005]
aws_iam_role_policy_attachment.internal_cloudwatch_composer: Refreshing state... [id=internal_worker_staging-2020120420465704850000000b]
aws_iam_role_policy_attachment.internal_cloudwatch_worker: Refreshing state... [id=internal_composer_staging-2020120420465704340000000a]
aws_security_group.external_composer: Refreshing state... [id=sg-0be4cfbfac3cc0022]
aws_vpc_endpoint.external_vpc_secretsmanager: Refreshing state... [id=vpce-013676c2939c3d681]
aws_vpc_endpoint.external_vpc_cloudwatch_logs: Refreshing state... [id=vpce-0ffb71834c608a4e5]
aws_vpc_endpoint.internal_vpc_cloudwatch_logs: Refreshing state... [id=vpce-01e031ba5033ab0c5]
aws_iam_role_policy_attachment.external_cloudwatch_worker: Refreshing state... [id=external_composer_staging-20210113203644029600000002]
aws_iam_role_policy_attachment.external_cloudwatch_composer: Refreshing state... [id=external_worker_staging-20210113203644009900000001]
aws_iam_policy.imagebuilder_workers_s3: Refreshing state... [id=arn:aws:iam::933752197999:policy/imagebuilder_workers_s3_staging]
aws_vpc_endpoint.internal_vpc_secretsmanager: Refreshing state... [id=vpce-0d13154306549b1cd]
aws_network_interface.composer_external: Refreshing state... [id=eni-02f250427cdd85dc7]
aws_ebs_volume.composer_external: Refreshing state... [id=vol-0daeecfc25da04a05]
aws_ebs_volume.composer_internal: Refreshing state... [id=vol-058d1cec56397f102]
aws_network_interface.composer_internal: Refreshing state... [id=eni-07088640399f60f49]
aws_iam_user_policy_attachment.imagebuilder_s3: Refreshing state... [id=imagebuilder_worker_staging-2020120420465705150000000c]
aws_eip.lb: Refreshing state... [id=eipalloc-0f8be222c563c4767]
aws_instance.composer_external: Refreshing state... [id=i-006c1b00085972e8d]
aws_instance.composer_internal: Refreshing state... [id=i-04fa20b9e3f3d85d1]
aws_volume_attachment.composer_external: Refreshing state... [id=vai-4047416848]
aws_launch_template.worker_external_x86: Refreshing state... [id=lt-04e6df10bd74694e7]
aws_volume_attachment.composer_internal: Refreshing state... [id=vai-3224493979]
aws_launch_template.worker_internal_x86: Refreshing state... [id=lt-0aae9d85fdd3f7067]
aws_spot_fleet_request.workers_external_x86: Refreshing state... [id=sfr-00e9d025-f57f-4188-84e0-835169aacec0]
aws_spot_fleet_request.workers_internal_x86: Refreshing state... [id=sfr-3ffc1651-26ac-4b37-a956-3bd24643f4dc]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.template_cloudinit_config.external_workers_cloud_init will be read during apply
  # (config refers to values not yet known)
 <= data "template_cloudinit_config" "external_workers_cloud_init"  {
      ~ id            = "3250833057" -> (known after apply)
      ~ rendered      = "H4sIAAAAAAAA/9RYW5PiOJZ+J6L+gze7I3Y3agFfMCQ5nR2DweZqGcuWfJndyPBFYGNhO21x7a7/vgFJ1mRlZe/07PRL84Skc3SOPj5954hhkTOSs6Z9KskDt91RlpZBxdrb9Ejiv3BhscvjoDo93ulTXVUMBEYD6N01LqMmJlWdFvkDJ7T4T41PjWbzrdGnxuveo7QuizplV9uAsSBKtiRnf+FWKSV5sCWPd2mesla0Wt/93cuugrxekaqp5lERp/n6geuFKXtjcE2ZkSNrR7TYxc2oyFfp+lNDT7fku+R+eGvTaOxqUtUPDY5rcpcMHjgSic3LZIPjOK6uk6dgx5KiSs8kfsrI6Wp7+TS5u7pOmlUdcIPBYKBI4BwMhVMkqpfhaGAOlMFgMByYw+NmpU2ndLwa5v00opPT1qlUpbKRSBddllljWyBlLx4uzwdh43WdPDHp0tVLsqxScAQuHd9HjtFvQ61UYv7c1w7g9DlbrZP+ancCXqc//awHXeNkY2UtJ6DQjivojuV0wqK2ZdI8VLV0XlpZh6Zl0TF9prDtevC8zqxBd3ROTuuwu5P1fnq0p8eOo2x2ls6PXfMMNiVZnVJn97mews+JiCozmw+U3W7qmWG1oZ+1BG+Dxb7an2xD3NUG2+eesknC5eFk9ERnuQnKedzuJ3bwvFSFg3bqIk3M3aizXB/4dWqG3ToNNfvcAzY5OpJs9u+fS9NwdG8elWu/olYwmcx9S0/Y2ejpsV8ZCw25hSUMyODUWScsApWh2DSUrf2yJ53P/LMCNTEaGh2DP5Ty4fC8TPYHMWehVNqLJYsJm33GMm8u8zJ3T5aV+6V41g4REYXQPXZ7edKnebKo/PWG9KLCzJcD7diOqNRVrdlpne6WkXL4nAn33o56uoueA4Vlh9kig5tRubFdkcj6TOgWo149m0SdtiNnp9ViH+s1TuJnYehOxhgb5blYh3xfxl7KQ1crcx+2BYLXwzb87OAT81bePV+tsBHFg0Ic+6t8Jp89iNzZrK/7WZAfj5LaQ0aaqTPQr9FG5Plzd3g68dPV9NkOZ4Iir3qrWAoiWC06o8hDsTZtC8oJOF1N2PQiPx2MjdkchGdX422Jre6PPBHMx0duG2yK6q8ViZOAtaJie/ct30ksyrLQv3J++MJ56o+mArBV+TI3XSrCRqOdsqvZSnqc2N2DkXXd+3zT9nukWAJTbev8Yd65l+dcEe7iIP0mWONQpYw8XRThdi3LgCUPXJtty5fr/XTRiKd9UNXXzKIXFXjgfr0lalgKmi5GT0ND16f2470UBat7nieyKIudsCN0Vr2VHK7kgPCxFPUFMbrvC33x5j009KVhqfDVvR+KsdyV5Y7ck0VJuu91hFAiYkCC1X1P6vaIKAX3Ytx5H3zwNFSh/biweLawhCFE8cxOlRHEM2Qhf2byGoLXNZ4NM2FmIahiFYxMx3d9XpMsNFN8nmI0AqYuemeAlTHKZCEUfZ5sddkeZSIcJygUoRLzEDqoXIRCOQsm/sbONAjRYW5STYl5/xliDMyMTkxbwxBpUswfU52XS1+L60goR8D1N6EDJGucbOxMeDbdeIlV3LUx9AkSVGwDNxgDw3ZLJT6Ul7XON2uZ5tp4BmMe5w6CDsKaClWNj7f6ydpoCZaSyh7zMsFl1+SBgngqQU3zrYztnYwW8RYYw2vOsyFCmuqLsYZUTb3aOv3RZWxmGjBzpXKw5lkY6N45WThOCRCmOckVaCCg6MJsoW/jKRwpR8/VzvFmPffwbIMzXQRUl/0sOUKEjgE6Yke9l/TRDJINPgdiWehSebQndII2iYSot1+IYKY702O0UTDBpe3xx0AXIgnj8mQeCh6M4NaTirPt0k6ogS4WsI8EJTczugjGsWJMNBbR0tKd/tZz4IlMsGUP2TnMfNVyWEeXoso7a3Mf452+BbWuxeWQYt4ZzSZQ8EeQxsAWtb2fwcrR8AjmeGFN4jly4rE9gWdLBYHjgG1MY8fSygBknU7MxwedaoFjT2XvnAihqzzreDBHql87qt7xx1pgq0LiaDSFtgIsFzq6CqZWrkiQpwcvp7sQUxQO2RnmWAxHcI/HwolMij1xk26kQhFnwjLKtFlolp1QrKWIYoYnOINjrCFhNrTFWNEREzwkWHiCE8tVYHieZaHkH+fnwRFuvbOJOieMgBLzWDEdzcCqMIZuPEWYqkPqW7raH5qUajArJN/2PV3KDv64X0dWf+5Rv/QyWsYi3CFhUIFMGBpqrOgYZ5YbQwcJQw9pY2sTU0DXZ2IrWSge5r/hq7z6QjfWzLQvIeQDEwlD0/E6H9+r41eOmutSgXkpApFSi4/kUCsXUTY92Y4QBKp2tFSqE+eY2BJ1IjuS4JkObTxDMAcHJ0e8PplKUICSx8Mi3q4FiMDe0rR0uD1Wsa14APU9n4eiMwHDaNwfW5OZqKtsaTlHGwh4rrveAYzrvUVp7kyiKhyXCE/0veGWh3CTWHh7ZNEE7SEvLG0bzZEzm6AhM4INDqIz3kLedwO1I9n2VEAOw8ZoNg8nCbUyrUZuMjXF4wiNcQdlAHi2JgN3IOGxnBsjZWHRmCdYMQ2z5JEYAzMfSABjy3fueYBQB6nlycoH52BC90CbdQw8g1BkJ+IAy3LjrZklYiAlwNr6u0jUJcfqi8ChAtwkjKhCd7gBvJcV8pwvZYg0wZoURy+LhQgBby5pc4Qhiod9GJ69U5zFrocyGQn+wqN6x8OJbp5nBsi1TeDMjtEGdfwNVK3MnFs5qG3rXoomQI422h64kPey2Q7QTDBdvT9MXzQZIlmdqkBDFM5gRkcmhtqLlvPz95ViYlj2Y3CoLwWsLGpStYo63KU0bhXV+r3xYDSCqmU9Cj2xJQmtbqclCDcbx4BzFT5Z1uJprnrW0wCCx6DKH4JD/VCTqCKs3gZ5sCbVw65ukqBmTeGhL0k9WRT6vX6/f7N6CCtyuPaqzZ6GCKG3/S2kWEM4XdpTAzzpAzAY38rcAIz+/8HqXVhHVVpeuvrmzaUZFdttkMfNzPRo0X+N71m2ql/hAgNdfaxZsE7zdZMcGanygDYPRZWRqm79XixHU/jYJixq32yar06vAdUhVG3r61lVMFoaU2A/Ibh4TBgr64d2+9vDtr4ethVsg3OR33Jpv21FPgr53USLFVv6cYfyt6zYpP9zGwSUFgcSP8XFNkjzmnvk/sbdMRJs35787r+4u2QXti6/7Pv5F9S+X+JeI0QB98jdfZx1FDSjirVKcmm9btm9bPhP5/eH5fHbD8h/5il4bNYJofSFm7/1Fvy3dpjm7TCok0ZNGNcku4Ir05KsgpQ26mJXReTjzrNBoqTg7izCWJqvufpUM7LlkqJml1dk667R+IGzCONYQr5bbLx+ixjlasKar2Pux3dX5E8FxYsOhBc40rxmQR4RjhUcnIAXOCBZpzUj1RWTrxaHlCVXm0Z7V1dtWkQBvWYSHGru27vJrQlrvkw19wHdEe6/L7fydSqNuR9/+Uca94X7lds8c82Ku2tZVz+LVWm+vuN+fjndWzl7ugV+uslZa1MXeePV/f+yvPudm3G/clfEqy3XXP3eBBofSe7t/xSu2Qx2rPgzEWdESlqcuEu94lZFxb1WgStpbosXyrxqBTcccBGpWLpKo4CRViMMatLtcM2Ya3I//fQT9+Mv715hX7ifuR9/eVs2vrwRnN8Kk5ETF+Txt7H+EJJ+UOj/IS9fULlW9W9p+PeFu48tXzj2FaHvoXhxaGbkdIXj3cZRxf7FjV9xfkPy707z5+PrtY5dlPsD1l6Uf1e+MWn8wNnGyPiPbRKcYpL/5wPnEC4nJL4oZFTke1JdakVaX8YjYHE0uCjlISE5dyAcDXZ5lLQaUcCuDL97g/StofzyFv1L/fhyx/3889sU/kQQv5bVXXnDlatJtU8jcsN3WZEyqAj3vo3495qryLZg5L3b9SLXRZQRVrcaLwX5Un1JHoSUcM1mXhy+7vayxa0b/et7WB/uezz/HZjN5qfG/wYAAP//jvFRA0MXAAA=" -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ part {
          ~ content      = <<-EOT
                #cloud-config
                
                users:
                  - name: ec2-user
                    ssh_authorized_keys:
                      - "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQCxjfFIIlGfCn9iclHymWrEBrTU2lL6tkSGT1ep7dCPzw1jY6WnhQlPXMpePriNxNXlG8cWO9/RFpBd0z9FwNy+kfgh9fuyNY49I+Ma6OyTVBg5hNoFxfRXG5iHtc/SQlnbEFiKpSk4lipo4QZtBtmgAqgkSA6Dzhygb6u5M9ixTIx4WBjuSM0GXQzNjpefyiWu+sIR+h2UrQkKABuuIYQbrjl+FhVmaLvrvyTO2usOtvnYBjhbPwyO72WPjapKd/9hTaqPE1wFy6UF2nXc4Pgw0giQb6sibFTz7NTexW35Q98qpQOWMYKcpgZrlSaHHKZSMhtzO7MdZrOLFUXoS1AeAy4ghtcNrOBTlb5SvP73zz0qBRF2cCO4O0wp5wwqPhvw2ntb3pTLPtdetJ+V50QPnpnXySSnZp2zFwce21bXx67nh9lnhLrZgje7coQnPAFx/cl36ESJygiuPcBw+k18YulYMXUqaBtkwJLkRjDpjTX2e5MJ16oD7sJHc4/W5kyfLvdMsVhdq1CXHGVVOpzogb095VYi0RXFpnZR/1eVgC/R+WVytYfY80rfVOcdAo2GZfnJ5zYRUXJJ9MZkanxx3E7UOikEJN9sUj200z6Cyy0IfIqTbJ1B5f7fd3acRrL4DcYUdFI/1ByNW6F1j7cZiAGOJKNbzXF0T3tf8x0e1Q== major@redhat.com"
                      - "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIPB1jFl4p6FTBixHT6wOk6X8nj/Z7eoPNQE/M0wK485K obudai@redhat.com"
                
                write_files:
                  - path: /tmp/cloud_init_vars
                    content: |
                      OSBUILD_COMMIT=83caf800e52524b414f7f5bf5ae0d3c912c89192
                      COMPOSER_COMMIT=9b2d565545752338741b3e2aeaf87367e23a82d4
                      OSBUILD_CA_CERT=LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUREVENDQWZXZ0F3SUJBZ0lVUDNQM2YzNVBGUk51b2Z0emM5TDk2RGhUb2RBd0RRWUpLb1pJaHZjTkFRRUwKQlFBd0ZqRVVNQklHQTFVRUF3d0xiM05pZFdsc1pDNXZjbWN3SGhjTk1qQXdPVEV6TVRZeU1EVTNXaGNOTXpBdwpPVEV4TVRZeU1EVTNXakFXTVJRd0VnWURWUVFEREF0dmMySjFhV3hrTG05eVp6Q0NBU0l3RFFZSktvWklodmNOCkFRRUJCUUFEZ2dFUEFEQ0NBUW9DZ2dFQkFNQnBrWVFYSVNMYzhLWWpNUVlnenBROUNBM1JLMmdIRDBxYXFzdjgKYVJjVkM2NlM5ZkhxRUUxaUxVWE83MDJRejVza2poM3pxTHlHUjh3UlYvL2NJMWIxcjBVeVpTY0xaM1c3VVpyQwo0NDRmY3ozTXl4bFN6V1VZU1BnQklLaGdBOHFtclpSMW9mYWRyeHVSTCtzbkZESWt4M3crYzFKZVVuMmNsMFdpClV0WDJHR1ZDRldNT2FvZkRrWFVDRnVLSHdKUWdGTHRzSENaWWNmdldWSFpaNk44d0dwMlFaWTI5Yzh1bXBqMVAKUEZsWEM4ZGFaTE1hWFliRTBNSXRWMENISnB3R0lwYnlubVlUbCtzRnV2bDRvVG1yeHoveXh6cER2Vk1PckFJbQp4b2s3clVtVHVkRGVFU1JCT2dBMUt1YU1SVHVhSXBRbzJkb3ZxKzAxRmYzQU4yVUNBd0VBQWFOVE1GRXdIUVlEClZSME9CQllFRko3ZTZYM3kwZG9scS9KYlZpYklpd2RuU1ArNk1COEdBMVVkSXdRWU1CYUFGSjdlNlgzeTBkb2wKcS9KYlZpYklpd2RuU1ArNk1BOEdBMVVkRXdFQi93UUZNQU1CQWY4d0RRWUpLb1pJaHZjTkFRRUxCUUFEZ2dFQgpBRnp2N2llS0c5bFpLckIyTW1aaEFxSElMeWxhT3lWcTc3RzlCTVJURnNwWnU0MHI3R1R3Y0Rodmg1RUNvSFFiCmxrdTBYNU9YZ0R2WHNCcG9GSHJ2MEtPSWxTN1VKMXYwNGsvSllnWHcrbGpUVHMvOXpwbjhSVmxtcHUvR01PTTUKUWJHUCtOajVaczVmR0ZXaE43TTI1UWtVODJKbHhlSkFsUXhIQ2xDUGV4UkNNYTF5NXA3VG5nODBLSld0eVBQOQp0U2dNQnA3NVVSZW80NUU4UEpySnAzaHlvNFJ4OVJRR2tyeWNSSXdmQkh2a3hNSmZuc2M3WS92NWl1RjhteE16CjN0Yko5K0p5RUF1SHoxYkd1cUNYK3FKUVRUdC9RbzYydkdXYUk5U1ZLYlM4YVhMQzJONnFjaWJxcjU4ZjRESkQKSnNsTS83cHN5cjFvNXR0YkJuNlk1QXM9Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K
                      COMPOSER_HOST=aws.composer.osbuild.org
                      COMPOSER_ADDRESS=172.31.64.11
                      WORKER_SSL_KEYS_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:brew_keys-7FUeel
                      SUBSCRIPTION_MANAGER_COMMAND_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:subscription-manager-command-kQYlo9
                      SYSTEM_HOSTNAME=staging-external-workers.aws.composer.osbuild.org
                      COMPOSER_DIR=/etc/osbuild-composer
                      SECRETS_MANAGER_ENDPOINT_URL=https://secretsmanager.us-east-1.amazonaws.com/
                  - path: /etc/osbuild-composer/osbuild-composer.toml
                    content: |
                      [koji]
                      allowed_domains = [ "team.osbuild.org", "hub.brew.osbuild.org", "worker.brew.osbuild.org" ]
                      ca = "/etc/osbuild-composer/ca-crt.pem"
                
                      [worker]
                      allowed_domains = [ "team.osbuild.org", "worker.brew.osbuild.org" ]
                      ca = "/etc/osbuild-composer/ca-crt.pem"
            EOT -> (known after apply)
            # (2 unchanged attributes hidden)
        }
      ~ part {
          ~ content      = <<-EOT
                #!/bin/bash
                set -euo pipefail
                source /tmp/cloud_init_vars
                
              - echo "Setting system hostname."
              + # Get the instance ID.
              + INSTANCE_ID=$(curl -Ls http://169.254.169.254/latest/meta-data/instance-id)
                
              + # Assemble hostname.
              + FULL_HOSTNAME="${SYSTEM_HOSTNAME}-${INSTANCE_ID}.aws.composer.osbuild.org"
              + 
              + # Print out the new hostname.
              + echo "Setting system hostname to ${FULL_HOSTNAME}."
              + 
                # Set the system hostname.
              - hostnamectl set-hostname $SYSTEM_HOSTNAME
              + hostnamectl set-hostname $FULL_HOSTNAME
            EOT
            # (1 unchanged attribute hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
    }

  # data.template_cloudinit_config.internal_workers_cloud_init will be read during apply
  # (config refers to values not yet known)
 <= data "template_cloudinit_config" "internal_workers_cloud_init"  {
      ~ id            = "1732152465" -> (known after apply)
      ~ rendered      = "H4sIAAAAAAAA/9RY2XLjOJZ9V0T+A8dVETMTOZK4iJLlLle0KJFaCYogAS49Ew4ukEgRImkSWqvy3ycky9lOp2u6erpeyk8GcDceH5x74WGRM5Kzpn0qyQO33VGWlkHF2tv0SOK/cGGxy+OgOj3e6VNdVQwERgPo3TUuqyYmVZ0W+QMntPhPjU+NZvOt0afGa+xRWpdFnbKrbcBYECVbkrO/cKuUkjzYkse7NE9ZK1qt7/7uZVdBXq9I1VTzqIjTfP3A9cKUvTG4lszIkbUjWuziZlTkq3T9qaGnW/JdcT+8tWk0djWp6ocGxzW5SwUPHInE5mWzwXEcV9fJU7BjSVGlZxI/ZeR0tb38NLm7uk6aVR1wg8FgoEjgHAyFUySql+VoYA6UwWAwHJjD42alTad0vBrm/TSik9PWqVSlspFIF12WWWNbIGUvHi7PB2HjdZ08MenS1UuyrFJwBC4d30eO0W9DrVRi/tzXDuD0OVutk/5qdwJepz/9rAdd42RjZS0noNCOK+iO5XTCorZl0jxUtXReWlmHpmXRMX2msO168LzOrEF3dE5O67C7k/V+erSnx46jbHaWzo9d8ww2JVmdUmf3uZ7Cz4mIKjObD5TdbuqZYbWhn7UEb4PFvtqfbEPc1Qbb556yScLl4WT0RGe5Ccp53O4ndvC8VIWDduoiTczdqLNcH/h1aobdOg01+9wDNjk6kmz2759L03B0bx6Va7+iVjCZzH1LT9jZ6OmxXxkLDbmFJQzI4NRZJywClaHYNJSt/bInnc/8swI1MRoaHYM/lPLh8LxM9gcxZ6FU2osliwmbfcYyby7zMndPlpX7pXjWDhERhdA9dnt50qd5sqj89Yb0osLMlwPt2I6o1FWt2Wmd7paRcvicCffejnq6i54DhWWH2SKDm1G5sV2RyPpM6BajXj2bRJ22I2en1WIf6zVO4mdh6E7GGBvluViHfF/GXspDVytzH7YFgtfDNvzs4BPzVt49X62wEcWDQhz7q3wmnz2I3Nmsr/tZkB+PktpDRpqpM9Cv0Ubk+XN3eDrx09X02Q5ngiKveqtYCiJYLTqjyEOxNm0Lygk4XU3Y9CI/HYyN2RyEZ1fjbYmt7o88EczHR24bbIrqrxWJk4C1omJ79y3fSSzKstC/cn74wnnqj6YCsFX5sjddKsJGo52yq9lKepzY3YORdd37fNP2e6RYAlNt6/xh3rmX51wR7uIg/SZZ41CljDxdFOF2LcuAJQ9cm23Ll+v9dNGIp31Q1dfKohcVeOB+vRVqWAqaLkZPQ0PXp/bjvRQFq3ueJ7Ioi52wI3RWvZUcruSA8LEU9QUxuu8LffHmPTT0pWGp8NW9H4qx3JXljtyTRUm673WEUCJiQILVfU/q9ogoBfdi3HmffPA0VKH9uLB4trCEIUTxzE6VEcQzZCF/ZvIagtczng0zYWYhqGIVjEzHd31ekyw0U3yeYjQCpi56Z4CVMcpkIRR9nmx12R5lIhwnKBShEvMQOqhchEI5Cyb+xs40CNFhblJNiXn/GWIMzIxOTFvDEGlSzB9TnZdLX4vrSChHwPU3oQMka5xs7Ex4Nt14iVXctTH0CRJUbAM3GAPDdkslPpSXs843Z5nm2ngGYx7nDoIOwpoKVY2Pt/rJ2mgJlpLKHvMywWXX5IGCeCpBTfOtjO2djBbxFhjDa82zIUKa6ouxhlRNvdo6/dFlbWYaMHOlcrDmWRjo3jlZOE4JEKY5yRVoIKDowmyhb+MpHClHz9XO8WY99/BsgzNdBFSX/Sw5QoSOATpiR72X9NEMkg0+B2JZ6FJ5tCd0gjaJhKi3X4hgpjvTY7RRMMGl7fHHQBciCePyZB4KHozg1pOKs+3STqiBLhawjwQlNzO6CMaxYkw0FtHS0p3+1nPgiUywZQ/ZOcx81XJYR5eiyjtrcx/jnb4Fta7F5ZBi3hnNJlDwR5DGwBa1vZ/BytHwCOZ4YU3iOXLisT2BZ0sFgeOAbUxjx9LKAGSdTszHB51qgWNPZe+cCKGrPOt4MEeqXzuq3vHHWmCrQuJoNIW2AiwXOroKplauSJCnBy+nuxBTFA7ZGeZYDEdwj8fCiUyKPXGTbqRCEWfCMsq0WWiWnVCspYhihic4g2OsIWE2tMVY0RETPCRYeIITy1VgeJ5loeQf5+fBEW69s4k6J4yAEvNYMR3NwKowhm48RZiqQ+pbutofmpRqMCsk3/Y9XcoO/rhfR1Z/7lG/9DJaxiLcIWFQgUwYGmqs6BhnlhtDBwlDD2ljaxNTQNdnYitZKB7mv+GrvPpCN9bMtC8h5AMTCUPT8Tof36vjV46a61KBeSkCkVKLj+RQKxdRNj3ZjhAEqna0VKoT55jYEnUiO5LgmQ5tPEMwBwcnR7w+mUpQgJLHwyLergWIwN7StHS4PVaxrXgA9T2fh6IzAcNo3B9bk5moq2xpOUcbCHiuu94BjOu9RWnuTKIqHJcIT/S94ZaHcJNYeHtk0QTtIS8sbRvNkTOboCEzgg0OojPeQt53A7Uj2fZUQA7Dxmg2DycJtTKtRm4yNcXjCI1xB2UAeLYmA3cg4bGcGyNlYdGYJ1gxDbPkkRgDMx9IAGPLd+55gFAHqeXJygfnYEL3QJt1DDyDUGQn4gDLcuOtmSViICXA2vq7SNQlx+qLwKEC3CSMqEJ3uAG8lxXynC9liDTBmhRHL4uFCAFvLmlzhCGKh30Ynr1TnMWuhzIZCf7Co3rHw4lunmcGyLVN4MyO0QZ1/A1UrcycWzmobeteiiZAjjbaHriQ97LZDtBMMF29P0xfNBkiWZ2qQEMUzmBGRyaG2ouW8/P3nWJiWPZjcKgvDawsalK1ijrcpTRuFdX6vfFgNIKqZT0KfEviW8J9SxBuJo4B5yp8sqzF01z1rKcBBI9BlT8Eh/qhJlFFWL0N8mBNqodd3SRBzZrCQ1+SerIo9Hv9fv9m9RBW5HAdVZs9DRFCb/EtpFhDOF3aUwM86QMwGN+63ACM/v/J6l1YR1VaXob65s2lGRXbbZDHzcz0aNF/ze9Ztqpf0QIDXX2sWbBO83UzzRmp8oA2D0WVkapu/V4oR1P42CYsat9smq9OrwnVIVRt6+u3qmC0NKbAfkJw8ZgwVtYP7fa+jEiTjwVJkDsS35U7/VCI4mb/fKx6Z3nf+haM1lcwWhfHVrANzkV+K7j9dlz5qK7vNlqs2NKPp5i/ZcUm/Z/bIqC0OJD4KS62QZrX3CP3N+6OkWD7Fp67/+Lukl3Yuvz53++/QPv9EfeaIQq4R+7u46qjoBlVrFWSy3h2q+4l4D9d3x9Wx28/Mv+Z5+KxWSeE0hcC/9Z78d/aYZq3w6BOGjVhXJPsCq5MS7IKUtqoi10VkY+n0waJkoK7swhjab7m6lPNyJZLippdXpqtu0bjB84ijGMJ+e6w8fpbxChXE9Z8XXM/vrtHfyooXsQivMCR5jUL8ohwrODgBLzAAck6rRmprph8tTikLLnaNNq7umrTIgrotZLgUHPfXlBuTVjzZau5D+iOcP99uZWvW2nM/fjLPxLCL9yv3OaZa1bcXcu6+lmsSvP1Hffzy9e91bynW+Knm+a1NnWRN17d/y/Lu98ZjPuVuyJebbnm6vcW0PhIl2//c+GazWDHij8TcUakpMWJuzQ1blVU3GuruJLmdnihzKtWcMMBF5GKpas0ChhpNcKgJt0O14y5JvfTTz9xP/7y7qX2hfuZ+/GXt73lyxvB+a00GTlxQR5/m+sPIekH08A/5OULKtfW/y0N/35w97HlC8e+IvQ9FC8OzYycrnC8CxxV7F8M/IrzG5J/9zV/Pr5e+9hFuT9g7UX5d+Ubk8YPnG2MjP/YJsEpJvl/PnAO4XJC4otCRkW+J9WlV6T1ZT0CFkeDi1IeEpJzB8LRYJdHSasRBezK8Ls3SN+Gzi9v0b/0jy933M8/vy3hTwTxa1vdlTdcuZpU+zQiN3yXFSmDinDvx4h/r7mKbAtG3rtdL3JdRBlhdavx0pAv3ZfkQUgJ12zmxeFrtJcQt5H1r+9hfbjv8fx3YDabnxr/GwAA//8rky76ZxcAAA==" -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ part {
          ~ content      = <<-EOT
                #cloud-config
                
                users:
                  - name: ec2-user
                    ssh_authorized_keys:
                      - "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQCxjfFIIlGfCn9iclHymWrEBrTU2lL6tkSGT1ep7dCPzw1jY6WnhQlPXMpePriNxNXlG8cWO9/RFpBd0z9FwNy+kfgh9fuyNY49I+Ma6OyTVBg5hNoFxfRXG5iHtc/SQlnbEFiKpSk4lipo4QZtBtmgAqgkSA6Dzhygb6u5M9ixTIx4WBjuSM0GXQzNjpefyiWu+sIR+h2UrQkKABuuIYQbrjl+FhVmaLvrvyTO2usOtvnYBjhbPwyO72WPjapKd/9hTaqPE1wFy6UF2nXc4Pgw0giQb6sibFTz7NTexW35Q98qpQOWMYKcpgZrlSaHHKZSMhtzO7MdZrOLFUXoS1AeAy4ghtcNrOBTlb5SvP73zz0qBRF2cCO4O0wp5wwqPhvw2ntb3pTLPtdetJ+V50QPnpnXySSnZp2zFwce21bXx67nh9lnhLrZgje7coQnPAFx/cl36ESJygiuPcBw+k18YulYMXUqaBtkwJLkRjDpjTX2e5MJ16oD7sJHc4/W5kyfLvdMsVhdq1CXHGVVOpzogb095VYi0RXFpnZR/1eVgC/R+WVytYfY80rfVOcdAo2GZfnJ5zYRUXJJ9MZkanxx3E7UOikEJN9sUj200z6Cyy0IfIqTbJ1B5f7fd3acRrL4DcYUdFI/1ByNW6F1j7cZiAGOJKNbzXF0T3tf8x0e1Q== major@redhat.com"
                      - "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIPB1jFl4p6FTBixHT6wOk6X8nj/Z7eoPNQE/M0wK485K obudai@redhat.com"
                
                write_files:
                  - path: /tmp/cloud_init_vars
                    content: |
                      OSBUILD_COMMIT=83caf800e52524b414f7f5bf5ae0d3c912c89192
                      COMPOSER_COMMIT=9b2d565545752338741b3e2aeaf87367e23a82d4
                      OSBUILD_CA_CERT=LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUREVENDQWZXZ0F3SUJBZ0lVUDNQM2YzNVBGUk51b2Z0emM5TDk2RGhUb2RBd0RRWUpLb1pJaHZjTkFRRUwKQlFBd0ZqRVVNQklHQTFVRUF3d0xiM05pZFdsc1pDNXZjbWN3SGhjTk1qQXdPVEV6TVRZeU1EVTNXaGNOTXpBdwpPVEV4TVRZeU1EVTNXakFXTVJRd0VnWURWUVFEREF0dmMySjFhV3hrTG05eVp6Q0NBU0l3RFFZSktvWklodmNOCkFRRUJCUUFEZ2dFUEFEQ0NBUW9DZ2dFQkFNQnBrWVFYSVNMYzhLWWpNUVlnenBROUNBM1JLMmdIRDBxYXFzdjgKYVJjVkM2NlM5ZkhxRUUxaUxVWE83MDJRejVza2poM3pxTHlHUjh3UlYvL2NJMWIxcjBVeVpTY0xaM1c3VVpyQwo0NDRmY3ozTXl4bFN6V1VZU1BnQklLaGdBOHFtclpSMW9mYWRyeHVSTCtzbkZESWt4M3crYzFKZVVuMmNsMFdpClV0WDJHR1ZDRldNT2FvZkRrWFVDRnVLSHdKUWdGTHRzSENaWWNmdldWSFpaNk44d0dwMlFaWTI5Yzh1bXBqMVAKUEZsWEM4ZGFaTE1hWFliRTBNSXRWMENISnB3R0lwYnlubVlUbCtzRnV2bDRvVG1yeHoveXh6cER2Vk1PckFJbQp4b2s3clVtVHVkRGVFU1JCT2dBMUt1YU1SVHVhSXBRbzJkb3ZxKzAxRmYzQU4yVUNBd0VBQWFOVE1GRXdIUVlEClZSME9CQllFRko3ZTZYM3kwZG9scS9KYlZpYklpd2RuU1ArNk1COEdBMVVkSXdRWU1CYUFGSjdlNlgzeTBkb2wKcS9KYlZpYklpd2RuU1ArNk1BOEdBMVVkRXdFQi93UUZNQU1CQWY4d0RRWUpLb1pJaHZjTkFRRUxCUUFEZ2dFQgpBRnp2N2llS0c5bFpLckIyTW1aaEFxSElMeWxhT3lWcTc3RzlCTVJURnNwWnU0MHI3R1R3Y0Rodmg1RUNvSFFiCmxrdTBYNU9YZ0R2WHNCcG9GSHJ2MEtPSWxTN1VKMXYwNGsvSllnWHcrbGpUVHMvOXpwbjhSVmxtcHUvR01PTTUKUWJHUCtOajVaczVmR0ZXaE43TTI1UWtVODJKbHhlSkFsUXhIQ2xDUGV4UkNNYTF5NXA3VG5nODBLSld0eVBQOQp0U2dNQnA3NVVSZW80NUU4UEpySnAzaHlvNFJ4OVJRR2tyeWNSSXdmQkh2a3hNSmZuc2M3WS92NWl1RjhteE16CjN0Yko5K0p5RUF1SHoxYkd1cUNYK3FKUVRUdC9RbzYydkdXYUk5U1ZLYlM4YVhMQzJONnFjaWJxcjU4ZjRESkQKSnNsTS83cHN5cjFvNXR0YkJuNlk1QXM9Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K
                      COMPOSER_HOST=aws.composer.osbuild.org
                      COMPOSER_ADDRESS=10.30.18.11
                      WORKER_SSL_KEYS_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:brew_keys-7FUeel
                      SUBSCRIPTION_MANAGER_COMMAND_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:subscription-manager-command-kQYlo9
                      SYSTEM_HOSTNAME=staging-internal-workers.aws.composer.osbuild.org
                      COMPOSER_DIR=/etc/osbuild-composer
                      SECRETS_MANAGER_ENDPOINT_URL=https://vpce-0d13154306549b1cd-9zxr7z5v.secretsmanager.us-east-1.vpce.amazonaws.com/
                  - path: /etc/osbuild-composer/osbuild-composer.toml
                    content: |
                      [koji]
                      allowed_domains = [ "team.osbuild.org", "hub.brew.osbuild.org", "worker.brew.osbuild.org" ]
                      ca = "/etc/osbuild-composer/ca-crt.pem"
                
                      [worker]
                      allowed_domains = [ "team.osbuild.org", "worker.brew.osbuild.org" ]
                      ca = "/etc/osbuild-composer/ca-crt.pem"
            EOT -> (known after apply)
            # (2 unchanged attributes hidden)
        }
      ~ part {
          ~ content      = <<-EOT
                #!/bin/bash
                set -euo pipefail
                source /tmp/cloud_init_vars
                
              - echo "Setting system hostname."
              + # Get the instance ID.
              + INSTANCE_ID=$(curl -Ls http://169.254.169.254/latest/meta-data/instance-id)
                
              + # Assemble hostname.
              + FULL_HOSTNAME="${SYSTEM_HOSTNAME}-${INSTANCE_ID}.aws.composer.osbuild.org"
              + 
              + # Print out the new hostname.
              + echo "Setting system hostname to ${FULL_HOSTNAME}."
              + 
                # Set the system hostname.
              - hostnamectl set-hostname $SYSTEM_HOSTNAME
              + hostnamectl set-hostname $FULL_HOSTNAME
            EOT
            # (1 unchanged attribute hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
    }

  # data.template_file.external_workers_cloud_config will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "external_workers_cloud_config"  {
      ~ id       = "8dd726781e421ca220d6b0237c6b44c8f9c7bd1fa0fc189891160c8ae91c4fd3" -> (known after apply)
      ~ rendered = <<-EOT
            #cloud-config
            
            users:
              - name: ec2-user
                ssh_authorized_keys:
                  - "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQCxjfFIIlGfCn9iclHymWrEBrTU2lL6tkSGT1ep7dCPzw1jY6WnhQlPXMpePriNxNXlG8cWO9/RFpBd0z9FwNy+kfgh9fuyNY49I+Ma6OyTVBg5hNoFxfRXG5iHtc/SQlnbEFiKpSk4lipo4QZtBtmgAqgkSA6Dzhygb6u5M9ixTIx4WBjuSM0GXQzNjpefyiWu+sIR+h2UrQkKABuuIYQbrjl+FhVmaLvrvyTO2usOtvnYBjhbPwyO72WPjapKd/9hTaqPE1wFy6UF2nXc4Pgw0giQb6sibFTz7NTexW35Q98qpQOWMYKcpgZrlSaHHKZSMhtzO7MdZrOLFUXoS1AeAy4ghtcNrOBTlb5SvP73zz0qBRF2cCO4O0wp5wwqPhvw2ntb3pTLPtdetJ+V50QPnpnXySSnZp2zFwce21bXx67nh9lnhLrZgje7coQnPAFx/cl36ESJygiuPcBw+k18YulYMXUqaBtkwJLkRjDpjTX2e5MJ16oD7sJHc4/W5kyfLvdMsVhdq1CXHGVVOpzogb095VYi0RXFpnZR/1eVgC/R+WVytYfY80rfVOcdAo2GZfnJ5zYRUXJJ9MZkanxx3E7UOikEJN9sUj200z6Cyy0IfIqTbJ1B5f7fd3acRrL4DcYUdFI/1ByNW6F1j7cZiAGOJKNbzXF0T3tf8x0e1Q== major@redhat.com"
                  - "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIPB1jFl4p6FTBixHT6wOk6X8nj/Z7eoPNQE/M0wK485K obudai@redhat.com"
            
            write_files:
              - path: /tmp/cloud_init_vars
                content: |
                  OSBUILD_COMMIT=83caf800e52524b414f7f5bf5ae0d3c912c89192
                  COMPOSER_COMMIT=9b2d565545752338741b3e2aeaf87367e23a82d4
                  OSBUILD_CA_CERT=LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUREVENDQWZXZ0F3SUJBZ0lVUDNQM2YzNVBGUk51b2Z0emM5TDk2RGhUb2RBd0RRWUpLb1pJaHZjTkFRRUwKQlFBd0ZqRVVNQklHQTFVRUF3d0xiM05pZFdsc1pDNXZjbWN3SGhjTk1qQXdPVEV6TVRZeU1EVTNXaGNOTXpBdwpPVEV4TVRZeU1EVTNXakFXTVJRd0VnWURWUVFEREF0dmMySjFhV3hrTG05eVp6Q0NBU0l3RFFZSktvWklodmNOCkFRRUJCUUFEZ2dFUEFEQ0NBUW9DZ2dFQkFNQnBrWVFYSVNMYzhLWWpNUVlnenBROUNBM1JLMmdIRDBxYXFzdjgKYVJjVkM2NlM5ZkhxRUUxaUxVWE83MDJRejVza2poM3pxTHlHUjh3UlYvL2NJMWIxcjBVeVpTY0xaM1c3VVpyQwo0NDRmY3ozTXl4bFN6V1VZU1BnQklLaGdBOHFtclpSMW9mYWRyeHVSTCtzbkZESWt4M3crYzFKZVVuMmNsMFdpClV0WDJHR1ZDRldNT2FvZkRrWFVDRnVLSHdKUWdGTHRzSENaWWNmdldWSFpaNk44d0dwMlFaWTI5Yzh1bXBqMVAKUEZsWEM4ZGFaTE1hWFliRTBNSXRWMENISnB3R0lwYnlubVlUbCtzRnV2bDRvVG1yeHoveXh6cER2Vk1PckFJbQp4b2s3clVtVHVkRGVFU1JCT2dBMUt1YU1SVHVhSXBRbzJkb3ZxKzAxRmYzQU4yVUNBd0VBQWFOVE1GRXdIUVlEClZSME9CQllFRko3ZTZYM3kwZG9scS9KYlZpYklpd2RuU1ArNk1COEdBMVVkSXdRWU1CYUFGSjdlNlgzeTBkb2wKcS9KYlZpYklpd2RuU1ArNk1BOEdBMVVkRXdFQi93UUZNQU1CQWY4d0RRWUpLb1pJaHZjTkFRRUxCUUFEZ2dFQgpBRnp2N2llS0c5bFpLckIyTW1aaEFxSElMeWxhT3lWcTc3RzlCTVJURnNwWnU0MHI3R1R3Y0Rodmg1RUNvSFFiCmxrdTBYNU9YZ0R2WHNCcG9GSHJ2MEtPSWxTN1VKMXYwNGsvSllnWHcrbGpUVHMvOXpwbjhSVmxtcHUvR01PTTUKUWJHUCtOajVaczVmR0ZXaE43TTI1UWtVODJKbHhlSkFsUXhIQ2xDUGV4UkNNYTF5NXA3VG5nODBLSld0eVBQOQp0U2dNQnA3NVVSZW80NUU4UEpySnAzaHlvNFJ4OVJRR2tyeWNSSXdmQkh2a3hNSmZuc2M3WS92NWl1RjhteE16CjN0Yko5K0p5RUF1SHoxYkd1cUNYK3FKUVRUdC9RbzYydkdXYUk5U1ZLYlM4YVhMQzJONnFjaWJxcjU4ZjRESkQKSnNsTS83cHN5cjFvNXR0YkJuNlk1QXM9Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K
                  COMPOSER_HOST=aws.composer.osbuild.org
                  COMPOSER_ADDRESS=172.31.64.11
                  WORKER_SSL_KEYS_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:brew_keys-7FUeel
                  SUBSCRIPTION_MANAGER_COMMAND_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:subscription-manager-command-kQYlo9
                  SYSTEM_HOSTNAME=staging-external-workers.aws.composer.osbuild.org
                  COMPOSER_DIR=/etc/osbuild-composer
                  SECRETS_MANAGER_ENDPOINT_URL=https://secretsmanager.us-east-1.amazonaws.com/
              - path: /etc/osbuild-composer/osbuild-composer.toml
                content: |
                  [koji]
                  allowed_domains = [ "team.osbuild.org", "hub.brew.osbuild.org", "worker.brew.osbuild.org" ]
                  ca = "/etc/osbuild-composer/ca-crt.pem"
            
                  [worker]
                  allowed_domains = [ "team.osbuild.org", "worker.brew.osbuild.org" ]
                  ca = "/etc/osbuild-composer/ca-crt.pem"
        EOT -> (known after apply)
      ~ template = <<-EOT
            #cloud-config
            
            users:
              - name: ec2-user
                ssh_authorized_keys:
                  - "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQCxjfFIIlGfCn9iclHymWrEBrTU2lL6tkSGT1ep7dCPzw1jY6WnhQlPXMpePriNxNXlG8cWO9/RFpBd0z9FwNy+kfgh9fuyNY49I+Ma6OyTVBg5hNoFxfRXG5iHtc/SQlnbEFiKpSk4lipo4QZtBtmgAqgkSA6Dzhygb6u5M9ixTIx4WBjuSM0GXQzNjpefyiWu+sIR+h2UrQkKABuuIYQbrjl+FhVmaLvrvyTO2usOtvnYBjhbPwyO72WPjapKd/9hTaqPE1wFy6UF2nXc4Pgw0giQb6sibFTz7NTexW35Q98qpQOWMYKcpgZrlSaHHKZSMhtzO7MdZrOLFUXoS1AeAy4ghtcNrOBTlb5SvP73zz0qBRF2cCO4O0wp5wwqPhvw2ntb3pTLPtdetJ+V50QPnpnXySSnZp2zFwce21bXx67nh9lnhLrZgje7coQnPAFx/cl36ESJygiuPcBw+k18YulYMXUqaBtkwJLkRjDpjTX2e5MJ16oD7sJHc4/W5kyfLvdMsVhdq1CXHGVVOpzogb095VYi0RXFpnZR/1eVgC/R+WVytYfY80rfVOcdAo2GZfnJ5zYRUXJJ9MZkanxx3E7UOikEJN9sUj200z6Cyy0IfIqTbJ1B5f7fd3acRrL4DcYUdFI/1ByNW6F1j7cZiAGOJKNbzXF0T3tf8x0e1Q== major@redhat.com"
                  - "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIPB1jFl4p6FTBixHT6wOk6X8nj/Z7eoPNQE/M0wK485K obudai@redhat.com"
            
            write_files:
              - path: /tmp/cloud_init_vars
                content: |
                  OSBUILD_COMMIT=${osbuild_commit}
                  COMPOSER_COMMIT=${composer_commit}
                  OSBUILD_CA_CERT=${osbuild_ca_cert}
                  COMPOSER_HOST=${composer_host}
                  COMPOSER_ADDRESS=${composer_address}
                  WORKER_SSL_KEYS_ARN=${worker_ssl_keys_arn}
                  SUBSCRIPTION_MANAGER_COMMAND_ARN=${subscription_manager_command}
          -       SYSTEM_HOSTNAME=${system_hostname}
          +       SYSTEM_HOSTNAME=${system_hostname_prefix}
                  COMPOSER_DIR=/etc/osbuild-composer
                  SECRETS_MANAGER_ENDPOINT_URL=https://${secrets_manager_endpoint_domain}/
              - path: /etc/osbuild-composer/osbuild-composer.toml
                content: |
                  [koji]
                  allowed_domains = [ "team.osbuild.org", "hub.brew.osbuild.org", "worker.brew.osbuild.org" ]
                  ca = "/etc/osbuild-composer/ca-crt.pem"
            
                  [worker]
                  allowed_domains = [ "team.osbuild.org", "worker.brew.osbuild.org" ]
                  ca = "/etc/osbuild-composer/ca-crt.pem"
        EOT
      ~ vars     = {
          ~ "composer_address"                = "172.31.64.11" -> (known after apply)
          - "system_hostname"                 = "staging-external-workers.aws.composer.osbuild.org" -> null
          + "system_hostname_prefix"          = "staging-external-worker"
            # (7 unchanged elements hidden)
        }
    }

  # data.template_file.internal_workers_cloud_config will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "internal_workers_cloud_config"  {
      ~ id       = "694e6d1f3e80d43fdd59caa1a8d47a5270c5436323b7f4cf523a3c7552ff9319" -> (known after apply)
      ~ rendered = <<-EOT
            #cloud-config
            
            users:
              - name: ec2-user
                ssh_authorized_keys:
                  - "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQCxjfFIIlGfCn9iclHymWrEBrTU2lL6tkSGT1ep7dCPzw1jY6WnhQlPXMpePriNxNXlG8cWO9/RFpBd0z9FwNy+kfgh9fuyNY49I+Ma6OyTVBg5hNoFxfRXG5iHtc/SQlnbEFiKpSk4lipo4QZtBtmgAqgkSA6Dzhygb6u5M9ixTIx4WBjuSM0GXQzNjpefyiWu+sIR+h2UrQkKABuuIYQbrjl+FhVmaLvrvyTO2usOtvnYBjhbPwyO72WPjapKd/9hTaqPE1wFy6UF2nXc4Pgw0giQb6sibFTz7NTexW35Q98qpQOWMYKcpgZrlSaHHKZSMhtzO7MdZrOLFUXoS1AeAy4ghtcNrOBTlb5SvP73zz0qBRF2cCO4O0wp5wwqPhvw2ntb3pTLPtdetJ+V50QPnpnXySSnZp2zFwce21bXx67nh9lnhLrZgje7coQnPAFx/cl36ESJygiuPcBw+k18YulYMXUqaBtkwJLkRjDpjTX2e5MJ16oD7sJHc4/W5kyfLvdMsVhdq1CXHGVVOpzogb095VYi0RXFpnZR/1eVgC/R+WVytYfY80rfVOcdAo2GZfnJ5zYRUXJJ9MZkanxx3E7UOikEJN9sUj200z6Cyy0IfIqTbJ1B5f7fd3acRrL4DcYUdFI/1ByNW6F1j7cZiAGOJKNbzXF0T3tf8x0e1Q== major@redhat.com"
                  - "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIPB1jFl4p6FTBixHT6wOk6X8nj/Z7eoPNQE/M0wK485K obudai@redhat.com"
            
            write_files:
              - path: /tmp/cloud_init_vars
                content: |
                  OSBUILD_COMMIT=83caf800e52524b414f7f5bf5ae0d3c912c89192
                  COMPOSER_COMMIT=9b2d565545752338741b3e2aeaf87367e23a82d4
                  OSBUILD_CA_CERT=LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUREVENDQWZXZ0F3SUJBZ0lVUDNQM2YzNVBGUk51b2Z0emM5TDk2RGhUb2RBd0RRWUpLb1pJaHZjTkFRRUwKQlFBd0ZqRVVNQklHQTFVRUF3d0xiM05pZFdsc1pDNXZjbWN3SGhjTk1qQXdPVEV6TVRZeU1EVTNXaGNOTXpBdwpPVEV4TVRZeU1EVTNXakFXTVJRd0VnWURWUVFEREF0dmMySjFhV3hrTG05eVp6Q0NBU0l3RFFZSktvWklodmNOCkFRRUJCUUFEZ2dFUEFEQ0NBUW9DZ2dFQkFNQnBrWVFYSVNMYzhLWWpNUVlnenBROUNBM1JLMmdIRDBxYXFzdjgKYVJjVkM2NlM5ZkhxRUUxaUxVWE83MDJRejVza2poM3pxTHlHUjh3UlYvL2NJMWIxcjBVeVpTY0xaM1c3VVpyQwo0NDRmY3ozTXl4bFN6V1VZU1BnQklLaGdBOHFtclpSMW9mYWRyeHVSTCtzbkZESWt4M3crYzFKZVVuMmNsMFdpClV0WDJHR1ZDRldNT2FvZkRrWFVDRnVLSHdKUWdGTHRzSENaWWNmdldWSFpaNk44d0dwMlFaWTI5Yzh1bXBqMVAKUEZsWEM4ZGFaTE1hWFliRTBNSXRWMENISnB3R0lwYnlubVlUbCtzRnV2bDRvVG1yeHoveXh6cER2Vk1PckFJbQp4b2s3clVtVHVkRGVFU1JCT2dBMUt1YU1SVHVhSXBRbzJkb3ZxKzAxRmYzQU4yVUNBd0VBQWFOVE1GRXdIUVlEClZSME9CQllFRko3ZTZYM3kwZG9scS9KYlZpYklpd2RuU1ArNk1COEdBMVVkSXdRWU1CYUFGSjdlNlgzeTBkb2wKcS9KYlZpYklpd2RuU1ArNk1BOEdBMVVkRXdFQi93UUZNQU1CQWY4d0RRWUpLb1pJaHZjTkFRRUxCUUFEZ2dFQgpBRnp2N2llS0c5bFpLckIyTW1aaEFxSElMeWxhT3lWcTc3RzlCTVJURnNwWnU0MHI3R1R3Y0Rodmg1RUNvSFFiCmxrdTBYNU9YZ0R2WHNCcG9GSHJ2MEtPSWxTN1VKMXYwNGsvSllnWHcrbGpUVHMvOXpwbjhSVmxtcHUvR01PTTUKUWJHUCtOajVaczVmR0ZXaE43TTI1UWtVODJKbHhlSkFsUXhIQ2xDUGV4UkNNYTF5NXA3VG5nODBLSld0eVBQOQp0U2dNQnA3NVVSZW80NUU4UEpySnAzaHlvNFJ4OVJRR2tyeWNSSXdmQkh2a3hNSmZuc2M3WS92NWl1RjhteE16CjN0Yko5K0p5RUF1SHoxYkd1cUNYK3FKUVRUdC9RbzYydkdXYUk5U1ZLYlM4YVhMQzJONnFjaWJxcjU4ZjRESkQKSnNsTS83cHN5cjFvNXR0YkJuNlk1QXM9Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K
                  COMPOSER_HOST=aws.composer.osbuild.org
                  COMPOSER_ADDRESS=10.30.18.11
                  WORKER_SSL_KEYS_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:brew_keys-7FUeel
                  SUBSCRIPTION_MANAGER_COMMAND_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:subscription-manager-command-kQYlo9
                  SYSTEM_HOSTNAME=staging-internal-workers.aws.composer.osbuild.org
                  COMPOSER_DIR=/etc/osbuild-composer
                  SECRETS_MANAGER_ENDPOINT_URL=https://vpce-0d13154306549b1cd-9zxr7z5v.secretsmanager.us-east-1.vpce.amazonaws.com/
              - path: /etc/osbuild-composer/osbuild-composer.toml
                content: |
                  [koji]
                  allowed_domains = [ "team.osbuild.org", "hub.brew.osbuild.org", "worker.brew.osbuild.org" ]
                  ca = "/etc/osbuild-composer/ca-crt.pem"
            
                  [worker]
                  allowed_domains = [ "team.osbuild.org", "worker.brew.osbuild.org" ]
                  ca = "/etc/osbuild-composer/ca-crt.pem"
        EOT -> (known after apply)
      ~ template = <<-EOT
            #cloud-config
            
            users:
              - name: ec2-user
                ssh_authorized_keys:
                  - "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQCxjfFIIlGfCn9iclHymWrEBrTU2lL6tkSGT1ep7dCPzw1jY6WnhQlPXMpePriNxNXlG8cWO9/RFpBd0z9FwNy+kfgh9fuyNY49I+Ma6OyTVBg5hNoFxfRXG5iHtc/SQlnbEFiKpSk4lipo4QZtBtmgAqgkSA6Dzhygb6u5M9ixTIx4WBjuSM0GXQzNjpefyiWu+sIR+h2UrQkKABuuIYQbrjl+FhVmaLvrvyTO2usOtvnYBjhbPwyO72WPjapKd/9hTaqPE1wFy6UF2nXc4Pgw0giQb6sibFTz7NTexW35Q98qpQOWMYKcpgZrlSaHHKZSMhtzO7MdZrOLFUXoS1AeAy4ghtcNrOBTlb5SvP73zz0qBRF2cCO4O0wp5wwqPhvw2ntb3pTLPtdetJ+V50QPnpnXySSnZp2zFwce21bXx67nh9lnhLrZgje7coQnPAFx/cl36ESJygiuPcBw+k18YulYMXUqaBtkwJLkRjDpjTX2e5MJ16oD7sJHc4/W5kyfLvdMsVhdq1CXHGVVOpzogb095VYi0RXFpnZR/1eVgC/R+WVytYfY80rfVOcdAo2GZfnJ5zYRUXJJ9MZkanxx3E7UOikEJN9sUj200z6Cyy0IfIqTbJ1B5f7fd3acRrL4DcYUdFI/1ByNW6F1j7cZiAGOJKNbzXF0T3tf8x0e1Q== major@redhat.com"
                  - "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIPB1jFl4p6FTBixHT6wOk6X8nj/Z7eoPNQE/M0wK485K obudai@redhat.com"
            
            write_files:
              - path: /tmp/cloud_init_vars
                content: |
                  OSBUILD_COMMIT=${osbuild_commit}
                  COMPOSER_COMMIT=${composer_commit}
                  OSBUILD_CA_CERT=${osbuild_ca_cert}
                  COMPOSER_HOST=${composer_host}
                  COMPOSER_ADDRESS=${composer_address}
                  WORKER_SSL_KEYS_ARN=${worker_ssl_keys_arn}
                  SUBSCRIPTION_MANAGER_COMMAND_ARN=${subscription_manager_command}
          -       SYSTEM_HOSTNAME=${system_hostname}
          +       SYSTEM_HOSTNAME=${system_hostname_prefix}
                  COMPOSER_DIR=/etc/osbuild-composer
                  SECRETS_MANAGER_ENDPOINT_URL=https://${secrets_manager_endpoint_domain}/
              - path: /etc/osbuild-composer/osbuild-composer.toml
                content: |
                  [koji]
                  allowed_domains = [ "team.osbuild.org", "hub.brew.osbuild.org", "worker.brew.osbuild.org" ]
                  ca = "/etc/osbuild-composer/ca-crt.pem"
            
                  [worker]
                  allowed_domains = [ "team.osbuild.org", "worker.brew.osbuild.org" ]
                  ca = "/etc/osbuild-composer/ca-crt.pem"
        EOT
      ~ vars     = {
          ~ "composer_address"                = "10.30.18.11" -> (known after apply)
          - "system_hostname"                 = "staging-internal-workers.aws.composer.osbuild.org" -> null
          + "system_hostname_prefix"          = "staging-internal-worker"
            # (7 unchanged elements hidden)
        }
    }

  # aws_instance.composer_external must be replaced
-/+ resource "aws_instance" "composer_external" {
      ~ arn                          = "arn:aws:ec2:us-east-1:933752197999:instance/i-006c1b00085972e8d" -> (known after apply)
      ~ associate_public_ip_address  = true -> (known after apply)
      ~ availability_zone            = "us-east-1f" -> (known after apply)
      ~ cpu_core_count               = 1 -> (known after apply)
      ~ cpu_threads_per_core         = 2 -> (known after apply)
      - disable_api_termination      = false -> null
      - ebs_optimized                = false -> null
      - hibernation                  = false -> null
      + host_id                      = (known after apply)
      ~ id                           = "i-006c1b00085972e8d" -> (known after apply)
      ~ instance_state               = "running" -> (known after apply)
      ~ ipv6_address_count           = 0 -> (known after apply)
      ~ ipv6_addresses               = [] -> (known after apply)
      + key_name                     = (known after apply)
      - monitoring                   = false -> null
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      ~ primary_network_interface_id = "eni-02f250427cdd85dc7" -> (known after apply)
      ~ private_dns                  = "ip-172-31-64-11.ec2.internal" -> (known after apply)
      ~ private_ip                   = "172.31.64.11" -> (known after apply)
      ~ public_dns                   = "ec2-34-234-177-181.compute-1.amazonaws.com" -> (known after apply)
      ~ public_ip                    = "34.234.177.181" -> (known after apply)
      ~ secondary_private_ips        = [] -> (known after apply)
      ~ security_groups              = [
          - "external_composer_staging",
        ] -> (known after apply)
      - source_dest_check            = true -> null
      ~ subnet_id                    = "subnet-0c016a02" -> (known after apply)
        tags                         = {
            "AppCode"      = "IMGB-001"
            "Name"         = "🏗 External Composer (staging)"
            "ServiceOwner" = "Image Builder"
        }
      ~ tenancy                      = "default" -> (known after apply)
      ~ user_data_base64             = "H4sIAAAAAAAA/9S6aZObSpov/r4i+jsw7hMx/3+cqSoWSbbc7YkRArQVmUVCJoK+Ew62EiTJYkALnD7f/UaisrvK25m+976YcQRhk/nks/6eJS2WVdklZXfr9HXyXiiOrMvqoOnui+ySxH8RwupYxkHTf3hjbkxdhRhoC+S9ueFvtyRp2qwq3wvSnfinmz/d3N6+JPrTzWfeWtbWVZt1I23QdUGUFknZ/UV4ylhSBkXy4U1WZt1d9HR4849TThOU7VPS3OplVMVZeXgvvA2z7gXBqHKXXLr7iFXH+Daqyqfs8KcbMyuSb5T780uam5tjmzTt+xtBuBW4Bu+FJJJv+eKNIAhC26Yfg2OXVk02JPHHPOlHWv7nVnjTtult0wbCYrFYqAoYgqXUR7LOX7WFtVAXi8VyYS0v9MnYbNjqaVnOs4it+8JtdLVxsMweZl1urxwpqd/Gy8fhLFFv5papxR73Zp08Nhm4gD1bvYtcOL9HRq3G4jA3zqD/NX86pPOnYw+8yXzzqxnMYO8Q9TBNQWVcntB+Nc3WXXRvW6wMdSPb1XY+YVldTSy/U7visPh0yO3FTBvS/hDOjlNznl2czWXiqvRom+Jqbw2A1slTn7nHX9sN+jWVcWPlu4V6PG48K2wo+9VISRE8nJpT70D52MLuVHoqTcPHcw/fyu4jDepdfD9PneDToy6djX6GDbncR5PHw1k8ZFY4a7PQcIa3wEkurjK15u8+1RZ0TW8X1Qe/YXawXu9820y7Ab41Y7+BDwbeV7a0SBb95JB2EWig6rBwap8e3yrDIH5SkSFHSziB4rmens+fHtPTWS67UKmdh8cuTrrtr2QqWo9lXe572y79Wh6Mc5TIUri/zN6W6ZyV6UPjH2jyNqqs8nFhXO4jpsx0e9sfsuNjpJ5/zaV33pF55h5/CtQuP28fckS1mjp7OZmaW2lWaW/b7Tqa3LvTvH96OMVmS9L4k7Tcr1eEwHqoDqE4nxIvE9HeqEsf3UsJOSzv0a8u6TvvyXsnNk8ERvGiklf+U7mdDh7C++12bvp5UF4uiv4WwyzXt2DeYiqL4jBb9r24edp8csKtpE6f3j7FShCh5mGiRR6Ojc29pPbAnRkSfRv52WIFtzsQDntDdJTu6d1FTCTrwwehCGjV/EeTxGnQ3UVV8eY13pNYnk6l+Yj55RXzzNc2EnD0KV/bPKoSNdiknhmOml3WzuwM89n+XUnv/bdJ9Qgs/d4Uz7vJu+lOqMJjHGSvhN2cm6xLPvKK8JyWddCl74X7rqiv6f2R14iPp6BpR82iaxV4L/z9WVFoq3jzoH1cQtPcOB/eKVHw9E4Uk6k8lSfhRJo8vX2ahk/TIBFjJZpLcvRuLs3l59NLaD5CW0efj89DOZ7OptPJ9O1UVpR3bydSqCRykARP794qs7eJrATv5HjytfDFx6WOnA8Pttg92NIS4XjrZKqGyBbb2N9aooHRuCd2y1za2hjpRAea5fp7XzQUG29VX2QEa8AyZW8ARF3hfCqFsi8mhTl1tFxGqxSHMlJjESEX1w+hVG+DtU+d3EAIn3cWM9RY9D8hQoCVs7XlGARhQ4nFS2aK09o34jaSag3sfRq6QLFXKXVy6ZO1jx+JTmYOQX6CJZ04YB+sAHT2tRqfa743ebWXG3uHbFEsktLFyMXE0JFuiHFh9jY1UqKkjbMSpwmpZ5YIVCwyBRmGb+fdyc1ZFRcALkedt0uMDd2XYwPrhj7SunONv1u5AaxSbVxieDYBpjekD65bA0xYmZQqghioprR9MIt4gzT14u2NIaaHnUe2lOSmDJg59fP0gjC+BPhCXP2dYmpblFAyBHJdmUp9cdZsjWmqYOadHmSwNd3NJaIqSUjteOIlMKVIIaTurXMlAg0VnlINzp5NQgPMiER8LKmllbOHYBWrcG10Eatt050Xnov6ZE1sZ9kNYe7rtttNTCVqvMHY+YQczQK0phHXS0ZEV9uukeRriMXAkY2Tn6PGNYiGSvJgr+MdduOVs0aDrYPAdUERs9i1jToA+WQSi/HZZEbgOpupN6RSuFc/mWSxw7rfuro58VdG4OhS6hosQ44K7D1yTR1s7FJVkMjOXsmOIWE4XHYDKokcauhEVlKfrKtTsk9nkY5kkkuPUW5sQ6uehHKrRIx0ZE1ytCIGlrZLR45VE3eShyWbrElq71UUDts8VPzLblhcUOENFp70BAM1FolquQYkurRC+3iDCdOXzLdNfb60GDNQXim+43umkp/91byN7PnOY37t5ayOZXTE0qIBubSEeqyahOT2PkYulpYeNlY2jRlghyFx1DyUz7sfnFU/n0X72LCyuYKxDywsLS3Xm3w/ry5fMGodahWVtQxkxmwxmoZG/RDlm95xpSDQjYutMzNxL6mjMDdyIgUNbOmQLUYlOLslFs31RkESUjwRVXFxkBAGJ9swsmVxaWJH9QCee76IZHcNltFqvrLXW9nUu0fbvThAIjtz753Bqj3ZjJXuOmrCVY3J2jzBfX0OaWqT4tJFa3xCovToOHiH3e0aLzsYUBJEAymQ6O8DfaI4zkbCbkegtt2F65TZudHifbqx5IuGV2SCcwA8x5iC/UIhq2kJNfXBZrGYENWCVi1iOQZWuVAAIbbvvhMBxhOs171dLoZgzU7A2E4g2SIkd33iAtvex4WVp3KgpMAu/GMkm4prz2XgMgnRtEt0abakQPTyaroT6ynChmSvq4uXx1KEgbdTjB0mCMfLOQoHr4/zeO/hfIol/8Fj5sQjqWkNWwhKgwbu9hJRPPEp0u3c2tklaB37nRKtwTSixgnskejl2yNguWTtzfkyu9ZkhKf6RgcGZmiLcqZZBBnXWi7uvukUvNBbMunjFSsCF6TxCs+W2eKwWaq6t0cpPFSHzXJxfQyfRSWoQ3ky22jmYaepEzPLd1/2l6rj77e1554PTkk6ryD9q/PXRza1agKdauIN1dkcagacugBDnYOhEqFW595QXcyhknytGjynOnu0moLxvc59p059p7oAWl2gU2fglX6g9uVpGq9J79uqGq7iU1QwMViJs80aVJ6zkQCL63iV2lg0jLAAfbJXxcCdH682Xx97D4bYJT3MVM2h0imSt1LgXvKHYt7751f+SMMVy4M9mr48Pz769BQv1aXv+qeowLONXqdhtriY/NGqHjhVD5eL3tQ2l40eA7L42k8qDBXrYLm+6O83B5ipO8+dHExnwZ+ZSfHMpIeDSReDaatrh1iv4hC720++C0SYqSx0jTrUjdxfb1mkmPNQAVnsstZfkT4S1d53UeXtraMnz7uXdmCFZEFBaLxUrdjdtoFrHmyZTDc6O/rFu9k3Nhuq5BWX2uvVB3+fHyz3UobKlvu7g5naR/KPff5CdxuL+gGvSRauGH3AHUuc6rDTNmegHQ5ewcSd9Q2mxsdx53nsXqRoqHbf239+zqZWF4DWua/VlMcCOnUKHN4YqynUKsmklQhoxS8RDDo1NWnFYzaY9Gd8VQYo51tNx/jSSvS1uvCdSjGdavCGSvZonQGnGjjmfYfzryTPqanv/FTfqc/1GvnUmedUvTdUCs8Vk1YyP29q1YXr/cyL59Z51PvnfHtfq2QwVIqp1ZTz9bkPhjrja0CrC4/7hdtB68LUKtGjlWw6lfRzvmrhOaM+sq+Necp90UMug1YD188f/cP1qzOup+eMeS762k/15bxE06kLc+DNtS5MWudcT74GtKr3KK8NvEZUU8+pGY8zryd/ELfUGziPaoAO17kuvGGsTTLQRv8yj1YTcxjtUDznGlOfjn7+mb7iWJ8GjqeamUN18Xl8rpg7c719Wknw6tfedMaaIPlOdQY/x6/CsekNo11nqHHedeHREWeXZx5T0+GxrVOOG44zn+P5p3xVZmqV/JwLE1+rU6DVDAzVxL/6ZupTjr+aecPISzY5nim36+d+uNbwmnG9uR95vP1rfnH9JuC5zgOtkgCtJtwGQEf//4zviBlz9EV14f7waZ2ao5wxhiK33eOY4euc1qnOPJf+gO/oL+5PqHF8jvYp5jUHzzw+UKsmHMvmuDfiYQBanXo/j5voOzxHq96kPBdGbEygxt9HWaOvIcc1jyn3C887Wl3+IG4FHHHKa1edeQPHfTXwGsRxPOJuxMY1x8ec4XjjefHzPM7ANe/7URftGj9Aq7Pp1Kk51rY657no0bFnn3l+mNof1YfFALWxRk54Hni8XmnXGQBqPI4jjs8j3pxKgtf+z2tU6v80jxe8/mXg/P3egPbpOZSnLCyt2UbzJOCYymZ5OCeafja1xeVVTzEOkqkx2exVlqwRC8eZZzp8O8uoHnAW05iaB6swBt4fLXl+jBTUey47xmtztlmBPtij2pON9gf9TrOcemXhi4O+6Wv/4P+iF4+91Xa5Xqj2C8YiWh2+z3shA61W0ViP6xVyah059dJ0ap1jDmm1wfsGX7ecegmvvWnJ8QO4Tk4lI1obiNaq6dQa+pn9eyIGqzm3dbrRO5bY6tZfkeN1ruSz1OL7sVt1LHFZDikzYI4MmOMppLEOc6+HuXWBOVIh3UgwN5bjGiVLSLEM6UaGuTmBNF1CulAg9RRIrQnM/RXMt+oPfK0H+y30XInBbP7z2e7FE8mkD1yjhRSsII0GmHNZ8QrS2IAUrSDVJUj1AVLfgLl+gbm/HOlGWquHua/DHE8g5fri4UpjnZc/8ec4Zxlk8NyYwUyl4xzrgjT8Zk58xveKlcEepeFSdQI3Pnp7JEUFbp9jweeuOlqlLCokngPfxMLV8BnuvWGjk0m8Ikd/RfLnsySSjdJ3foQxFTuGeSAyyTYGYFHpsyhT1XiPKt+ditc7BTuFP7H1BbbVcI1YVEz5Gdm31edY/QA7OoJ4qGkoS+dQASzKpq/j2Z8PSJ86sAQi9+NDAU7hXj3xeD4U88ErSR2urGOobMuHpao7zJx5+3j4Gd3z3eilj7+ec4dgpffA8ffBHlWYARW5UxqV7PytH9QUjrlWTU1+F6JjH6PjbHOd4XiP4H3w8nmO5HWXzwu8T49zjzPOlK/848nmDK42M5/qMzAsZkDGM99ZzHxXn/kFnoHVZmY6+cyk+czX9Jnn4JmveTOv0Gemdpj5KzyDjvV6vl8RBumB47eHxTaFhU8hVQtID1NIFzwvc0jz85WGFLDY5pB6E1iQFBa4h5TTR1/dB1Xeg6a8d4x3PT4f8r7FbdL4rDTOMmP/5nMiuM4OU5/3C63qfT6P0nG+eWU/dM2ZT60ZcMyZN1gzzzmMvjALb+a7eGYO3E4882Q8g/zd0WdQwzNTi2beEI1rPl28tl9biJCmOSxMERZGAQtLhFSXYWFNIN0MkKo5LLAIC+8C6WYCaSRDehgg1UVIPXk8R63LVz1kymdPXxvvvXx+GMb7rzO+87mT93QKxp5dp9f+Xcn8buzR6uzzu8ZQZ/CrecZ08AxQbwYdcwa4H0YbuV087tYMDJuZJ3ObNzPgRDOgcawcZp7jzbzRb9x+76v4GxQWRgapNx1rGM2nkG4LWOAzLPQzpJ4I6YbbOkB6kGCh95DiC6SogHQxGfcLXfo6/kCrM/M6p17GWZm/U977Rz8o5vX/AkTzOQf4jMf9NeJCG+dKPte8xr8TzcxhMTO5fTKema41Mzm2V/zOHM086s38Qh/9YPJc0awR72DguMlnoOAY2XwV/4MMaUwhNTJYIAZpJEJqMFiYA6TmGVKQwcKTr30g6iHd9JByzGwkSFUKKWPj2dfx5/cYnsfUHMZ5SBrx4Iw5PwFDnT/fR6XxfspzgNs91Nk4349rfGZ/bT/Pcb/wZmBlzXzNmgHNHG0zeR4UeObRzcws+Lo+xp7XC19bjPgAzmbmO9/Lf5BCGk2vmF6cP/9nk5WTtY0nB0skNtHZysZAJToe9x6sGtiY6Ylba5Zo9LYcq7HIlpYbbwlh2xBL6k46DKajfvJEfDE1XwMuyk1FF4kYZ+4+1jFhO1ueB7abyp44VTEm5jLfImsfr4KcEAdvt0jULwQTNVZi06MABi7ah2sQWAORPVmisZhWnjgFQU4UhyAjwRK29gwSPReJPP5wMEP7aMf3YvHlXq2GWHLwPt760ld6uN0SFan78ocCl6W7hBkbu7gESE4rXzel4MDxrCq+HBsBllRTjzWsGGsssswUEUJ4q2JCVMtBWytHirWPS18kD5Y731q5gZC2GTzROEcGcVxCGtfZyJ7I0DKXJI9uG0uq4YM8NeBKV8i+UgJWp0m56N0CZKECclOvL7G4rbx9fQrEWsGDcfRE6RSTjeJriyYitQV1IgYGKUIp33ls64e4A1HffcLydhm74AQYst18MzGHeGoSdWPqrQxk0sXYEs21MUv0+d4c0k9I2l4ARSB0iQzseU1ccSB7AnyrnnmiYTwMRuXozCEFWZpSPjFX8acgawdEfC/S/WNE0sDPJ41VqmfX2TbAsUTgTpSoBNDM295edSdHI5+cvWElhXFeFqkeisQNJX/v5uhsSeoyKfxT7G4mWEpFS54ThKetbdSZjy+N74JdIM41ew8m9toTzfXWAK6xjRQ8BBjsgIbFsIx2wGBZgr1TsDY6Z12XDgZTpB8GW++2scFKc7XNYpH5ZCVBX4zLBwVBMADVLWNCVgz5onGxHVL4MqDYlRiRDDE+17251wfLjYGVGyqS69KnqeLLvhKLSB1/fKIqtoixeRC3qr2PVaQbuVXEkOQpAjpZ+ZJB3LwVXXsugvJwDik4LVkqRg4BQNQvO1k8xcWcwnVMMGE6YZtzkG+NUIkdGxskLC0lWvmFY2z6gMQ9XF1EItZDgC9Ls0DbhyG+BHp8wSTfOXjrJ7qvWwQsfXHqWrkBHGz2cF/7IfPPXh6j2N0MdjEtA0M/ef08f5D9Bhq+YVK/2g0AJlSVTXn+iPJ5ZepIdc71yMs29ImVGwXUydLCkmYVhhqLRHn2QWvlhhKLoHQxe4gltrSYQWzdUNA+dj/bhfOtAdYxtjEjS5b3cI8oGtjMZemW6+UULCfyZXBzU4oL0PkYrMN8cnZJnIf6pXNKP3P1rewNWzfBl+5buyY7X06rYGUNzp74JmWiJ0bThNWevSff/RHy6x8GLWIYjr5FFkY8p5cW7krTqptYZDQpfcMurR67hBLdUmzZ2Jh7RBN8nrj6pgH6vN9JYBIoi7NH0n3sxp989/IIckaicjNBGmosKQ0skXlgME5L6kt2CWisxxQZaIC464k+9QKxOydrdvE1okGX5dG6OhMndcIhdR4UAjBJH8MiXaN8M/FdPLEIgInengj2RV+udmhFcKJ3Gw+jFZK3Bib1DBLwEA9WH8h1H2IpI4pR20W9j/sOx3jrhm7b44KswB4QTwEXS/LOjobOEdu6cG9Mo0OdknweOMtO86Vaw0Vdebi2yTquAkXNsVJfcIFQpCwUzwUTJzc2YdaJZNWpzppdPCVWQ4pyW47EsERytGaWTQBZFuYpXBMQStUEDblk6ung7OPHB4lhT2ZbhGuUuGRtDn4VD2jp9fMOi4ce5bWLC+CiNdiT3E99Gp3ICtloBSZB1u4iOb9YzBgSZnQmvrShLp2BGyuWI+6efyQ3nNz6QQ+sPnz9o4ttP3zc6Z79cYHAh6Ap3wfn9n2bRE3StUVQBoekeX9sb5Og7W6l93NFeTuVpfnb+Xz+TPU+uXRJUwbsY1QVddUmzfh5z+1hqosH51mcjVV7iTaPzgaCj+YCLFbPXwYsgPZ/Lrk9hm3UZHWXVeXt85HbqCqKoIxvc8tj1fyzfM92dPPjGtoOWJj6h7YLDll5uP2s++1n3e+Cc3v35aVqw2PG4ruqOXztN22DPtwnXXT/TPOFw2eJ+hLpjv3FWB1oj3ADnI8YPXxIu65u39/fv7b27ou1d0ERDFX5rMv9y883vifym4W7rirY97/q+Fte0ew/n18CxqpzEn+MqyLIylb4IPxNeNMlQfHS8jf/JrxJj+Fd2CTnr9fPVZMnzbdbwmcJUSB8EN58X+souI2a7q5Oijc3n7W7Mvyn9ft/psePP7r7Zz6fu9y2acLYFZw/+n7uX+7DrLwPgza9aZNOuE2OlVBndfIUZOymrY5NlHz/a52bJEor4Y2ddF1WHoS2b7ukENKq7cqgSO7e3Nz8WbCTTujS5JvNm8//ijomtEl3+/ld+OWrHPkf5YprIQi5O7Ky7YIySoSuEtAaXN2BkkPWdkkz+uQLxTnr0pHm5v7YNvesigI2ahKcW+F1bgqHpLu9Lt2eAnZMhP/Fs/LzUhYLv/z2R0Xud+HvAv0k3DbCmzt7PGd3TVYe3gj/frXuZT37+Cz443M9u6NtVd58Pv4zyjf/RWbC34XR400h3D79VxW4+V7Nff4GVbi9DY5d9T8JOFpSs6rnsOE9SwjKWIiSpsuesijokvYKnivRCJ3n2iEsFy/p7m7CoE1mE+E2Fm6Fv/71r8Ivv331Advvwr8Lv/z2snv8/qLufCXlc2X6Ixmvvpz4roRnRn8kJ0/6/4scSMq4rrKyuz02jKfBTzrf799Jm++OIn+YK6+GjdfJ8XLrzY+or+j/4tCf+I47h/vuRZ58R/h/F9Df6Kr90XYgWqz0D/dxcrovT0UildKN7Swc/Tq3nILmnmXht7PLV63lWP8DI21XNcHhRXs51p/XhKr8Qnd3kz0J/yIcmqTmWPgs83fhvm6q6L6ojmXX/oXDr7wRhD8Letkem0TQVVvIWuHpyFjPh5YyibokFp6ypu3ubgThqWoEZ2PqSMhK4Tfx7k4Rxd//IsTV2N+zJ6Htgk745YXxX2TwP2GTBPn476fs+kE6S5JakG4EIa7K5GZUZZkmUc557Q17/JT+uXlmrRCwJgniXiiCOOHqjDZentqPWflU/UhskT+1d5en9tX+zajCKM8M8i8V5faFn4MuEeKsSaKuanouqsjaNisPXHCRx1kj3L727ZXdIo55zxtnnKe2C8KxnI0O5yevkf3ltxe6/P46QlzVOHkKjqxrBVEQ3wh/F7okEW6DF0y5Dpzla6NGBVDC4WjrD1l5vFwnz0vXctlNwpGSRFUp3KKT8Bl/12McSy+8XSfNaG9VjkejtDrzU8LHrz31/puV7ziFJE32xKtd8DwPPSM2a4Vzk3VByJIbQeiqY5S+On1/VzfVKeNqZOXhY8ShwQ0Za8AfEj5l/23qwT8xSL7K9qQ5ZdHnDriI6bHt/rHbVQLj81TJMz8Qyqq85SNVHDSxUFdNd/V31gosaVuBZXnCen4oTG7+LLRRUJZJPKKzbqowie9u/iw4UIP/X5EGfZyU//97wU2EMuFEUcRZcAA1WcSHjpbL5KEsk46P/QJLTgkTgk5oq4LzH3vRvwnhsRPOCU/vf+2ENDglQtYJTXZIO6Gsznc3XzJpxPYVfPHz398Uxtugzu7aKsqT7i6+v+FZ8c8fq05J02RxchdV5RPvY2N1PjIm/PWvgg6Nm7/ZI+l/3jyMzrW7JgmKD6/f5u/ezm448VUkH+PjICmq8rZJWBXEPFyPTVIHzbe15V+5I4uqS4TrfelLlMdYXPVs715wLoI2/8LleuY/pLvnUy/okpInknB7W1bnL/RXUc/Hnr3wR2e+47hvMun29k83/zsAAP//b15njWY1AAA=" -> "H4sIAAAAAAAA/9S7eY+cSJ43/n9J8x5YT0u7q96s4sjETs94tUkCeRJRHBEkzG9lcVVCEBwG8oCefu8/BVl2V9lu98zzPH/sWkJVBPG9P98jCrysyi4pu4nT18l7rjjRLquDpnsosmsS/4ULq1MZB03/4Y2xMTQFIqAuLO/NHbub4KRps6p8zwn3/J/u/nQ3mbzc9Ke7z7zVrK2rNuvGvUHXBVFaJGX3F+4po0kZFMmHN1mZdffR0/HNb1ROE5TtU9JMtDKq4qw8vufehln3YsOocpdcu4eIVqd4ElXlU3b8052RFck3yv355Z67u1ObNO37O46bcEyD91wSiRO2eMdxHNe26cfg1KVVkw1J/DFP+nEv+zfh3rRtOmnagFssFgtFAkOwFPpI1NitujAXymKxWC7M5ZU86ZsNXT0ty3kW0XVfuI2mNA4S6V7ucnvlCEn9Nl4+DheBeLJbpiZ9PBh18thk4AoOdPUucuH8wdJrJeaHuX4B/c/50zGdP5164E3nm5+NQIa9g5XjLAWVfn2yDqtZtu6iB9ukZajp2a628ynN6mpq+p3SFcfFp2NuL2R1SPtjKJ9mxjy7Opvr1FXIyTb41cEcAKmTpz5zTz+3G+vnVESNme8Wyum08cywIfRnPcVFsD83596B4qmF3bn0FJKGj5cevhXdRxLUu/hhnjrBp0dNuOi9jHSxPETTx+OFP2ZmKLdZqDvDW+AkV1eamfN3n2oTuoa3i+qj31A7WK93vm2k3QDfGrHfwL2ODpUtLJJFPz2mXQQaqDg0nNnnx7fSMPCfFEsXoyWcQv5Szy6XT4/p+SKWXSjVzv6xi5Nu+zOe8eZjWZeH3rZLvxYH/RIlohAervLbMp3TMt03/pEkb6PKLB8X+vUhopKs2dv+mJ0eI+Xycy68807UMw7oU6B0+WW7zy2i1sQ5iMnM2Apypb5tt+to+uDO8v5pf46NFqfxJ2F5WK8whvVQHUN+PsNexlsHvS5960FI8HH5YP3s4r7znrx3fPOEYRQvKnHlP5Xb2eBZ6LDdzg0/D8rrVdLeIpjl2hbMW0REnh/kZd/zm6fNJyfcCsrs6e1TLAWR1eynauShWN88CEoPXFkXyNvIzxYruN2BcDjovCN1T++ufCKYHz5wRUCq5r+aJE6D7j6qijev8Z7E4mwmzEfML2+Yp766EYCjzdja5lERiE6ntaw7SnZdO/IF5vLhXUke/LdJ9QhM7cHgL7vpu9mOq8JTHGSvhN1dmqxLPrKK8JyWddCl77mHrqhv6f2R1YiP56BpR82iWxV4z/39WVFoK2izVz8uoWFsnA/vpCh4esfzyUycidNwKkyf3j7NwqdZkPCxFM0FMXo3F+biM/USGo/Q1qzP5PNQjGfybDadvZ2JkvTu7VQIpUQMkuDp3VtJfpuIUvBOjKdfC198XGqW82Fv893eFpYWirdOpqgW3iIb+VuT15E1PuO7ZS5sbWRpWAOq6foHn9clG20Vn6cYqcA0RG8AWFmhfCaEos8nhTFz1Fy0VikKRUuJectyUb0PhXobrH3i5LplocvOpLoS8/4nC2Ng5nRtOjq2kC7F/DUz+Fnt63EbCbUKDj4JXSDZq5Q4ufDJPMSPWMOygy0/QYKGHXAIVgA6h1qJLzV7Nn31LNcPDt5aMY9LF1kuwrpmaTofF0ZvEz3FUto4K36W4Fo2eaAgnkqWrvt23p3dnFZxAeBy1Hm7REjXfDHWkaZr4153rrJ7M9eBWSqNi3XPxsDwhnTvujVAmJZJqVgQAcUQtnujiDeWqly9gz7E5Ljz8Jbg3BABNWZ+nl4thK4BumJXeycZ6tZKCB4Csa4Mqb46a7pGJJUQ9c57EWwNd3ONiIITXDsefw0MIZIwrnvzUvFAtQpPqgbnQKehDmQsYB8JSmnmdB+sYgWu9S6itW2488JzrT5ZY9tZdkOY+5rtdlNDihpv0Hc+xiejAK2hx/WSYt5Vt2tL8FWLxsAR9bOfW42rY9Uq8d5exzvkxitnbQ22BgLXBUVMY9fW6wDk02nMxxeD6oHrbGbekArhQflk4MUOaX7rasbUX+mBowmpq9PMchRgHyzX0MDGLhXJ4unFK+kpxBSFy26wSiyGqnXGK6FP1tU5OaRypFkizoXHKNe3oVlPQ7GVIoo7vMa5tcI6ErZLR4wVA3WChwQbr3FqHxQrHLZ5KPnX3bC4WoU3mGjaYwSUmMeK6eoQa8LKOsQbhKm2pL5taPOlSalu5ZXkO75nSPnFX83byJ7vPOrXXk7rWLROSFg0IBeWUIsVA+PcPsSWi4Slh/SVTWIK6HFIHCUPxcvud2iVz7TWIdbNbC4h5AMTCUvT9abfz6vrF4yax1qxyloEIqU2H81Cvd5H+aZ3XCEINP1qa9RI3GvqSNSNnEiyBrp08BZZJbi4JeKN9UayBEvyeKuKi6NgIXC2dT1bFtcmdhQPoLnn85borsEyWs1X9norGlr3aLtXBwh4Zxy8C1i1Z5vS0l1HTbiqEV4bZ3ioLyFJbVxcu2iNzhYvPDoO2iF3u0bLDgYEB9GAC4v3D4E2lRxnIyC3w1Dd7sJ1Su1cb9Eh3ZjiVUUrPEU5AJ6jz8BhIeHVrISqsrdpzCdYMaFZ80iMgVkuJICx7bvveIDQFGl1b5eLIVjTM9C3U4i3liV2feIC2z7EhZmnYiClwC78UyQakmvPReBSwSJpl2iCvCSA9/JqtuPrmYV0wV5XVy+PhQgBbyfpO4QtFC/nVjh4fZzHBw/lMyT4e48aUw+nhjlsISh1Erjba0TQ1CeWZufmzi5B69jvpGgNZhHRz+Bg8V6+PQGaC+bBmC+zW0220EzbaEBH1NpaOVVNbOm3Ws7vvukUrNCbIu7jFS0CF6TxCsnLbHHcLBXNO1gpPFbHzXJxu3SfRiWoQ3Eqb1TjuFOVqZHluy/Pl4rjH7a1516OTok7r8D9K/rbJRpqNYVONfWG6mIMNQVOXYChzsFQ8VCtc2+orsZQCb5aDZ5TXTxSzcB4X+e+U6e+U10Bqa7QqTPwSj9Q++Isjde4921FCVfxOSooH6x4ebMGledsBEDjOl6lNuJ1PSxAnxwUPnDnp5vNt8s+gCF2cQ8zRXWIcI7ErRC413xfzHv/8sofabiieXCwZi/px0ubneOlsvRd/xwVSN5odRpmi6vBLrXqgVP1cLnoDXVz3WgxwIuv/aTAUDKPpuvz/mFzhJmy89zp0XAW7JINgmSDHI8GWQyGrawdbL6KQ+xuP/ku4GGm0NDV61DTc3+9pZFkzEMJZLFLW3+F+4hXet+1Ku9gnjxx3r20A0k4CwpM4qVixu62DVzjaIt4ttHoyS/eyd/YrCuCV1xrr1f2/iE/mu61DKUt83cHM6WPxN/3+QvdbcRrR7TGWbiiZI86mjjVcaduLkA9Hr2C8jvzG0yNl+PO89i9CtFQ7b73/Pm6GGpdAFLnvloTFgvo1ClwWGOsZlCtBINUPCAVO0RQ6NTEIBWL2WCQH/FVKCCMbzUb40sq3lfrwncqyXCqwRsq0SN1BpxqYJj3Hca/EjynJr7zQ31nPtNr5FNnnlP13lBJLFcMUomM3lCrK9P7mRfLrcuo94/59r5aiWCoJEOtCePrMx8MdcbWgFoXHvMLs4PUhaFWvEcq0XAq4cd8lcJzRn1EXx3zlPmih0wGqQamnz/6h+lXZ0xPzxnznPfVH+rLePGGUxfGwJprXRikzpmebA2oVe8RVhtYjahmnlNTFmdWT/4gbqk3MB7VAB2mc114w1ibRKCO/qUeqabGMNohec4tpj4Z/fwjffmxPg0MTzU1hurqs/jcMHdhevukEuDNr73hjDVB8J3qAn6MX4lh0xtGuy5QZbzrwiMjzq7PPGaGw2Jbpww3DGc+w/MP+SrUUCvxORemvlqnQK0pGKqpf/PNzCcMfzX1hpGXaDA8E2bXj/1wq+E1ZXozP7J4+7f8YvpNwXOdB2olAFJNmQ2AjP7/Ed8RM8boi+rK/OGTOjVGOWMMeWa7xzDD1tlep7qwXPoDvqO/mD+hyvA52icZtxy8sPhAtZoyLBvjsxEPA1Dr1Ptx3HjfYTla9QZhuTBiYwpVdj/KGn0NGa5ZTJlfWN6R6voHcSvgiFNWu+rMGxjuq4HVIIbjEXcjNm45PuYMwxvLix/ncQZued+Puqi3+AFSXQynTo2xttU5y0WPjD37wvLDUP+oPiwGqI41csrywGP1Sr3NAFBlcRxxfBnx5lQCvPV/VqNS/4d5vGD1LwOX7/cG65BeQnFGw9KUN6onAMeQNsvjJVG1i6Eurq96in4UDJWKRq/QZG3RcJx5ZsO3s4ziAWcxi4lxNAt9YP3RFOenSLJ6z6WneG3ImxXog4NVe6Le/k6/U02nXpno6ljf9LXf+L/oxWNvtV2ml1X7BaURqY7f570QgVor1liP65Xl1Jrl1EvDqTWGOUutddY32Lrp1Et4601Lhh/AdHIq0SK1bpFaMZxatX5k/wHzwWrObJ1ttI4mtrL1V/h0myvZLLX4fuxWHU1cmkNCdZhbOszRDJJYg7nXw9y8wtxSINkIMNeX4xrBS0iQCMlGhLkxhSRdQrKQIPEkSMwpzP0VzLfK7/haCw5b6LkChdn8x7PdiysScR+4egsJWEESDTBnsuIVJLEOibWCRBMg0QZIfB3m2hXm/nLcN+41e5j7GszRFBKmLxpue8zL8gf+HOcsHQ+eG1OYKWScY12Qht/Mic/4XtEyOFhpuFScwI1P3sESogK1z7Fgc1cdrVIaFQLLgW9i4aroAg/esNHwNF7hk7/C+TMtjkS99J3fw5iCHN04YhFnGx3QqPRplClKfLAq353xtzMFPYc/sPUFtpVwbdGomDEa0beV51j9DnY0C6KhJqEoXEIJ0CibvY5nfzla2syBJeCZH/cFOIcH5cziuS/mg1fiOlyZp1DalvulojnUkL1DPPxo3/PZ6KWPv55zh2Cl9cDxD8HBqhAFiuXOSFTSy7d+UFI45lo1M9hZiIx9jIyzzW2GYz2C9cHr5zmS1V02L7A+Pc49zjhTvvKPJxoyXG1kn2gyGBYyEJHsOwvZdzXZL5AMVhvZcHLZILnsq5rsOUj2VU/2Ck021KPsr5AMHfP1fL/CFJIjw28Pi20KC59AohSQHGeQLFhe5pDkl9seXMBim0PiTWGBU1igHhK2P/rqPKiwHjRjvWM867H5kPUtZpPKZqVxlhn7N5sTwW12mPmsX6hV77N5lIzzzSv7oWvIPjFl4BiyN5iy5xxHXxiFJ/suko2B2YlkT0QyZPeOJkMVyYYayd4QjWs+Wby2X13wkKQ5LAweFnoBC5OHRBNhYU4h2QyQKDksEA8L7wrJZgpJJEJyHCDReEg8caQj5vWrHjJjs6evjudeNj8M4/nXGe/Z3Ml6OgFjz67TW/+uRHY29kh18dlZY6gz+NU8YzhIBsSToWPIgPlhtJHZxeJuymDYyJ7IbN7IwIlkoDKsHGXP8WRv9Buz3/sq/jqBhZ5B4s3GGkbyGSTbAhboAgvtAonHQ7Jhtg6QHAVYaD0k6AqJVUCymI7PC034Ov5ArTPjNqdex1mZ3RPW+0c/SMbtbwG88ZwDbMZj/hpxoY5zJZtrXuPfiWRjWMgGs09EsuGassGwvWJn5kj2iCf7hTb6wWC5opoj3sHAcJPLoGAY2XwV/6MISUwg0TNYWBSSiIdEp7AwBkiMCyQgg4Un3vpA1EOy6SFhmNkIkCgEEkpH2tfxZ+cYlsfEGMZ5SBjx4Iw5PwVDnT+fR4XxfMpygNk91Nk4349rbGZ/bT/Lcb/wZLAyZV81ZaAao20Gy4MCyR7ZyEbB1rUx9qxe+OpixAdwNrLvfC//QQpJNLthenH5/McmM8drG02PJo9trNGVjYCCNTQ+25s1sBHVErdWTV7vbTFWYp4uTTfeYky3IRKUnXAcDEf55PHoaqi+ClwrNySNx3ycuYdYQ5jubHEe2G4qevxMQQgby3xrmYd4FeQYO2i7tXjtihFWYik2PAJg4FqHcA0Cc8CiJwok5tPK42cgyLHkYEtPkIDMA4VYy3ksji8OZOsQ7dizmH/5rFZCJDjoEG994Ss93G5pFan78kWBS9NdQvWNXVwDS0wrXzOE4MjwrEi+GOsBEhRDi1Uk6WvE08zgLctCWwVhrJiOtTVzSzIPcenzeG+6862Z65albgaP1y+Rjh0X48Z1NqLHU2uZC4JHto0p1HAvznS40iR8qKSA1mlSLnq3AFkogdzQ6mvMbyvvUJ8DvpbQoJ88XjjHeCP56qKJcG1CDfOBjotQyHce3foh6kDUd5+QuF3GLjgDatluvpkaQzwzsLIxtFYEIu5iZPLGWpcTbX4whvSTJWyvgFggdLEI7HmNXX7ABwx8s5Y9Xtf3g145GnVwgZeGkE+NVfwpyNrBwr4Xaf4pwmng59PGLJWL62wb4Jg8cKdSVAJo5G1vr7qzo+JPzkE3k0K/LItUC3nshoJ/cHPrYgrKMin8c+xupkhIeVOcYwvNWluvMx9dG98Fu4Cfq/YBTO21xxvrrQ5cfRtJaAgQ2AEV8WEZ7YBOswR552Ctd866Lh0EZpZ2HGyt28Y6LY3VNot56uOVAH0+LveSBcEAFLeMMV5Ry+f1q+3gwhcBQa5AsaDz8aXujYM2mG4MzFxXLLEufZJKvuhLMW8p48snoiAT65s9v1XsQ6xYmp6bRQxxnlpAwytf0LGbt7xrz3lQHi8hAeclTfnIwQDw2nUn8ue4mBO4jjHCVMN0cwnyrR5KsWMjHYelKUUrv3D0TR/guIerK4/5egjQdWkU1nY/xNdAi68I5zsHbf1E8zUTg6XPz1wz14GDjB4eaj+k/sXLYyt2N4NdzMpA185eP8/3ot9A3dcN4le7AcCEKKIhzh+tfF4ZmqU4l3rkZeva1Mz1Amp4aSJBNQtdiXksPfugNXNdinlQuojuY4EuTapjW9Ml6xC7n+1C+VYH6xjZiOIlzXt4sIg1UNml6Zbp5RQ0x+J1cHNDiAvQ+Qisw3x6cXGch9q1c0o/c7Wt6A1bN0HX7lu7pjtfTKtgZQ7OAfsGobzHR7OE1p59wN99Cfn1i0ET67qjbS0TWSynlybqSsOsm5inJCl93S7NHrmYYM2UbFHfGAeLJOgydbVNA7R5vxPANJAWFw+nh9iNP/nu9RHkFEflZmqpVmMKaWDy1AODfl4SX7BLQGItJpZuDRB1PdZmXsB3l2RNr76KVejSPFpXF+ykTjikzl7CAOH0MSzStZVvpr6LpiYGMNHaM0Y+74vVzlphlGjdxkPWyhK3OsK1DDHYx4PZB2Ldh0jIsKTXdlEf4r5DMdq6odv2qMArcADYk8DVFLyLo1qXiG5deNBn0bFOcT4PnGWn+kKtoqKuPFTbeB1XgaTkSKqvqLCsSFpIngumTq5vwqzj8apTnDW9elKshMTKbTHiw9ISozU1bQzwsjDO4RqDUKim1pALhpYOziF+3AsUeSLdWqi2EhevjcGv4sFaev28Q/yxt/LaRQVwrTU44NxPfRKd8cqyrRWYBlm7i8T8alJ9SKjeGejahppwAW4smQ6/e35Jrju5+Ts9sPrw9UsX295/3Gme/XFhgQ9BU74PLu37NomapGuLoAyOSfP+1E6SoO0mwvu5JL2dicL87Xw+f971Prl2SVMG9GNUFXXVJs34ec/kONP4o/MszkaKvbQ2j84Ggo/GAixWz18GLID6fy65PYVt1GR1l1Xl5JlkElVFEZTxJDc9Ws0/y/dsRzM+rqHtgIWhfWi74JiVx8ln3Sefdf/aPerG+vCQdNFD1YanjMZfb7S1paU59hebNKA+wg1wPiJr/yHturp9//Dw2qj7L0bdB0UwVGVwae+jqnh4+ZXG90R+s3DfVQX9/scbf8srkv33801AaXVJ4o9xVQRZ2XIfuL9xb7okKO6fOd5XzfHNf3Bv0lN4HzbJ5ev1S9XkSfPtI+6zhCjgPnBvvq91FEyipruvk+LN3Wftbgz/af3+n+nx+9/W/TNfyV0nbZpQesPg730m9y8PYVY+hEGb3rVJx02SU8XVWZ08BRm9a6tTEyXf/yjn7s/cKum4Lk24rGy7oIwSbqPe322A7SzAUvu4UT/89G/RqaHcZN9yDGzvHx4EeX4vzqb3zz8faNAlbfdQJF0wiYMuePjMa5LF/85kLNo2KUKacGnVdmVQJPd3Otrvf8uVNz/98lX6/Dr56ZcXWvx6/4zgGyhfBoYJeGyysuOq082UMrm8kJREacW9sZOuy8oj1/ZtlxRfHnNdxf30yytlfr0fWdrPfvmK4P7u829RR7k26SZfWP30is3/jvg/O+dW5ELmoC846CrOWoObM6zkmLVd0rxGyiXr0nHP3cOpbR5oFQV01CS4tNzrgsQdk25yW5qcA3pKuP+PlaLPS1nM/fTLHxXwX7m/c+QTN2m4N/f2SGd3TVYe33D/ebPuZa3++Cz443OtvidtVd59Jv/Rzjf/IDPu79zo8abgJk//qAJ33+snz9/XcpNJcOqq/03AUZOaVj2DDevHXFDGXJQ0XfaURawm3MBz2zRC5zlvueXi5b77uzBoE3nKTWJuwv31r3/lfvrlq4/zfuX+k/vpl5ct89cXxfYrKZ/LxB/JePVVyHclPDP6Izl50v9f5EBSxnWVld2EldmffvlRu//1O2nz3THrD3Pl1SD1OjlePnrze7tv6P/i0B/4jjmH+e5FnnxH+P8U0N9piv3RdqC1WGkfHuLk/FCei0QohTvbWTjabVg7B80DzcJvB7avms2p/g0jbVc1wTH5rbmc6s9rXFV+2Xd/lz1x/8Idm6RmWPgs81fuoW6q6KGoTmXX/oXBr7zjuD9zWtmemoTTFJvLWu7pRGnPJrUyibok5p6ypu3u7zjuqWo4Z2NoFpeV3C/8/b3E87/+hYurcajJnri2CzrupxfGf5HB/oVNEuTj70/Z7WN7miQ1J9xxXFyVyd2oyjJNopzxOuj2+N8Enltn1nIBbZIg7rkiiBOmzmjj9an9mJVP1e+JLfKn9v761L56fjeqMMozgvxLRZm88HPQJVycNUnUVU3PRBVZ22blkQku8jhruMlr397YLeKY9bxxsHtquyAcy9nocEZ5i+xPv7zQ5dfXEWKqxslTcKJdy/Ec/4b7O9clCTcJXjBlOjCWr40aFbASBkdb22fl6Xobt69dy2Q3CUNKElUlN7HO3Gf83cgYll54u06a0d6qHEmjtLowKu7j1556/83Kd5yCkyZ7YtUueJ6GnhGbtdylybogpMkdx3XVKUpfUT/c1011zpgaWXn8GDFoMEPGGvCHG5+y/zH14B+Znr6X7UlzzqLPHXARk1Pb/fa0qzjK5qmSZX7AlVU5YSNVHDQxV1dNd/N31nI0aVuOZnlCe0YUJnd/5tooKMskHtFZN1WYxPd3f+YcqMJ/K9Kgj5Py399zLpuC2aYoYiwYgJosYkNHy2TepuSOnXU4mpwTygUd11YF4z/2ov/gwlPHXRKW3v/acWlwTris45rsmHZcWV3u775k0ojtG/ji55/fFMZJUGf3bRXlSXcfP9yxrPjnyapz0jRZnNxHVfnE+thYnU+Ucn/9K6dB/e5v9rj1v+/2o3PtrkmC4sPru/m7t/Id23wTyYb4OEiKqpw0Ca2C+HaaSOqg+ba2/CtzZFF1CXc7JH6J8hiLm57t/QvORdDmX7jcaP5LuH+merEvKVkicZNJWV2+7L+JeiZ79sIf0XzHcd9k0mTyp7v/PwAA//+a//ZQQjYAAA==" # forces replacement
      ~ vpc_security_group_ids       = [
          - "sg-0be4cfbfac3cc0022",
        ] -> (known after apply)
        # (4 unchanged attributes hidden)

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
      - ebs_block_device {
          - delete_on_termination = false -> null
          - device_name           = "/dev/sdb" -> null
          - encrypted             = true -> null
          - iops                  = 150 -> null
          - kms_key_id            = "arn:aws:kms:us-east-1:933752197999:key/9630f91f-f3c0-42eb-b65d-3defffc79926" -> null
          - tags                  = {
              - "AppCode"      = "IMGB-001"
              - "Name"         = "🏗 External Composer (staging)"
              - "ServiceOwner" = "Image Builder"
            } -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-0daeecfc25da04a05" -> null
          - volume_size           = 50 -> null
          - volume_type           = "gp2" -> null
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
        }


      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/sda1" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ tags                  = {} -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-097a991decc240a94" -> (known after apply)
          ~ volume_size           = 25 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
        # (1 unchanged block hidden)
    }

  # aws_instance.composer_internal must be replaced
-/+ resource "aws_instance" "composer_internal" {
      ~ arn                          = "arn:aws:ec2:us-east-1:933752197999:instance/i-04fa20b9e3f3d85d1" -> (known after apply)
      ~ associate_public_ip_address  = false -> (known after apply)
      ~ availability_zone            = "us-east-1a" -> (known after apply)
      ~ cpu_core_count               = 1 -> (known after apply)
      ~ cpu_threads_per_core         = 2 -> (known after apply)
      - disable_api_termination      = false -> null
      - ebs_optimized                = false -> null
      - hibernation                  = false -> null
      + host_id                      = (known after apply)
      ~ id                           = "i-04fa20b9e3f3d85d1" -> (known after apply)
      ~ instance_state               = "running" -> (known after apply)
      ~ ipv6_address_count           = 0 -> (known after apply)
      ~ ipv6_addresses               = [] -> (known after apply)
      + key_name                     = (known after apply)
      - monitoring                   = false -> null
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      ~ primary_network_interface_id = "eni-07088640399f60f49" -> (known after apply)
      ~ private_dns                  = "ip-10-30-18-11.ec2.internal" -> (known after apply)
      ~ private_ip                   = "10.30.18.11" -> (known after apply)
      + public_dns                   = (known after apply)
      + public_ip                    = (known after apply)
      ~ secondary_private_ips        = [] -> (known after apply)
      ~ security_groups              = [] -> (known after apply)
      - source_dest_check            = true -> null
      ~ subnet_id                    = "subnet-04a176042c3118735" -> (known after apply)
        tags                         = {
            "AppCode"      = "IMGB-001"
            "Name"         = "🏗 Internal Composer (staging)"
            "ServiceOwner" = "Image Builder"
        }
      ~ tenancy                      = "default" -> (known after apply)
      ~ user_data_base64             = "H4sIAAAAAAAA/9S6aZOcSJYu/D3N+j8w6jab97WazGSJIBXq1tgEAcSWuCeLO0vfMRlbBjjOIiAW6K7/fs2JlDpTUqmm770fZmSGVeHL8XOe85zFM1jVVZ9W/a0zNOkHrjzSPm/Ctr8v80ua/JmL6mOVhO3w8Z2xNTQFIqAuLf/dDXu7xWnb5XX1gRPu+D/c/OHm9vb1oj/cfJGt5l1Td3k/rQ37PoyzMq36P3PPOU2rsEw/vsurvL+Lnw/v/rHLacOqe07bW62K6ySvDh+4hyjvXy2YVO7TS38f0/qY3MZ19Zwf/nBj5GX6nXJ/fL3m5ubYpW334YbjbjmmwQcujcVbNnjDcRzXddmn8NhndZuPafKpSIdpLft3y73ruuy27UJuuVwuFQmM4UoYYlFjr+rSXCrL5XK1NFcX8qxvt3T9vKoWeUw3Q+m2mtI6SKSPcl/Ya0dIm4dk9TSeBeLLbpWZ9MkzmvSpzcEFeHT9Pnbh4t7SGyXhx4V+BsMvxfMhWzwfB+DPFttfjFCGg4OVwzwDtX55trz1PN/08b1t0irS9Hzf2MWM5k09M4Ne6cvD8vOhsJeyOmbDIZKPc2ORX5ztZeYq5Ggb/NozR0Ca9HnI3eMv3db6JRNRaxb7pXI8bn0zagn9Rc9wGT6e2tPgQPHYwf5U+QrJoqfzAB9E94mEzT65X2RO+PlJE876ICNdrLx49nQ484fcjOQuj3RnfABOenGlubl4/7kxoWv4+7g5BC21w81mH9hG1o/wwUiCFj7qyKttYZkuh9kh62PQQsWh0dw+PT1I48h/VixdjFdwBvlzMz+fPz9lp7NY9ZHUOI9PfZL2u1/wnDefqqbyBtuugkYc9XOcikLkXeSHKlvQKntsgwNJH+LarJ6W+uU+ppKs2bvhkB+fYuX8SyG894/UNzz0OVT64rx7LCyiNsTxxHRu7AS5Vh+63Sae3bvzYnh+PCVGh7Pks7DyNmuMYTPWh4hfzLGf85anN1Vg3QspPqzurV9cPPT+s/+eb58xjJNlLa6D52o3H30LebvdwgiKsLpcJO0BwbzQdmDRISLy/CivhoHfPm8/O9FOUObPD8+JFMZW+zhTYx8l+vZeUAbgyrpAHuIgX67hbg+i0dN5R+qf31/4VDA/fuTKkNTtf7RpkoX9XVyX797yPU3E+VxYTJxfXTlPA3UrAEebs7HtkyIQnc4aWXeU/LJx5DMsZO99Re6Dh7R+AqZ2b/Dn/ez9fM/V0TEJ8zeH3ZzbvE8/sYzwEpZN2GcfuPu+bK7h/YnliE+nsO0mzeJrFvjA/f1FUWgraPuoflpBw9g6H99Lcfj8nufTuTgXZ9FMmD0/PM+j53mY8okULwQxfr8QFuLL7hU0nqCtWV+2LyIxmcvz+Wz+MBcl6f3DTIikVAzT8Pn9gyQ/pKIUvheT2beHLz+tNMv5+Gjz/aMtrCyU7JxcUS28QzYKdiavI2ua4/tVIexsZGlYA6rpBl7A65KNdkrAU4xUYBqiPwKsrFExFyIx4NPSmDtqIVrrDEWipSS8ZbmoeYyEZhduAuIUumWh896kupLwwWcLY2AWdGM6OraQLiX8JTf4eRPoSRcLjQq8gEQukOx1RpxC+Gx6yRPWsOxgK0iRoGEHeOEaQMdrlOTcsLnZm7lC9xy8sxIeVy6yXIR1zdJ0PimNwSZ6hqWsddb8PMWNbPJAQTyVLF0P7KI/uQWtkxLA1aTzboWQrgVioiNN16a17kJl72ahA7NSWhfrvo2B4Y/Zo+s2AGFapZViQQQUQ9g9GmWytVTl4nv6mJDD3sc7ggtDBNSYB0V2sRC6hOiCXe29ZKg7KyV4DMWmNqTm4mzoBpFMQtQ/PYpgZ7jbS0wUnOLG8flLaAixhHEzmOeaB6pV+lI9Oh6dRTqQsYADJCiVWdDHcJ0ocKP3MW1sw12UvmsN6QbbzqofoyLQbLefGVLc+qO+DzA+GiXoDD1pVhTzrrrbWEKgWjQBjqifgsJqXR2rVoUf7U2yR26ydjbWaGsgdF1QJjRxbb0JQTGbJXxyNqgeus527o+ZEHnKZwMv90gLOlczZsFaDx1NyFyd5pajANuzXEMDW7tSJIunZ7+ixwhTFK360aqwGKnWCa+FId3Up9TL5FizRFwIT3Gh7yKzmUViJ8UU93iDC2uNdSTsVo6YKAbqBR8JNt7gzPYUKxp3RSQFl/24vFilP5poNmAElITHiunqEGvC2vKSLcJUW9HANrTFyqRUt4paCpzAN6TiHKwXXWwv9j4NGr+gTSJaRyQsW1AIK6glioFxYXuJ5SJh5SN9bZOEAnoYU0cpIvG8/429ype9lpfoZr6QEAqAiYSV6fqzH8fV5StHzUOjWFUjApFSm4/nkd48xsV2cFwhDDX9YmvUSN1L5kjUjZ1Yska6cvAOWRU4uxXijc1WsgRL8nmrTsqDYCFwsnU9X5WXNnEUH6CFH/CW6G7AKl4v1vZmJxpa/2S7FwcIeG94/hmsu5NNaeVu4jZaNwhvjBP0mnNEMhuXlz7eoJPFC0+Og/bI3W3QqochwWE84tLiAy/UZpLjbAXk9hiqu320yahd6B3ysq0pXlS0xjNUAOA7+hx4Swmv5xVUlUebJnyKFROaDY/EBJjVUgIY24H7ngcIzZDWDHa1HMMNPQF9N4N4Z1liP6QusG0vKc0iE0MpA3YZHGPRkFx7IQKXChbJ+lQT5BUBvF/U8z3fzC2kC/amvvhFIsQI+HtJ3yNsoWS1sKLRH5Ii8XxUzJEQPPrUmPk4M8xxB0Glk9DdXWKCZgGxNLsw93YFOsd+L8UbMI+JfgKexfvF7ghoIZiesVjl15xsobm21YCOqLWzCqqa2NKvuZzff1cpWKI3RTwka1qGLsiSNZJX+fKwXSma71kZPNSH7Wp5ffSAxhVoInEmb1XjsFeVmZEX+6/zK8UJvF3ju+eDU+HeL/HwZv/1EQ21nkGnnvljfTbGhgKnKcHYFGCseag2hT/WF2OshUCtR9+pzz6p52B6b4rAabLAqS+A1BfoNDl4ox9oAnGeJRs8BLaiROvkFJeUD9e8vN2A2ne2AqBJk6wzG/G6HpVgSD2FD93F8Wrz9bE9MCYuHmCuqA4RTrG4E0L3UjyWiyE4v8Eji9a0CD1r/nr/9GjzU7JSVoEbnOISyVutyaJ8eTHYo9YDcOoBrpaDoW4vWy0BePktTgqMJPNgugEfeNsDzJW9784OhrNkj2wQJBvkcDDIcjRsZeNg840fEnf3OXABD3OFRq7eRJpeBJsdjSVjEUkgT1zaBWs8xLwyBK5V+5559MVF/9oOJOE8LDFJVoqZuLsudI2DLeL5VqPHoHwvf2ezrgh+eWn8QXkMvOJgupcqknYM7x7myhCLv435K91txGsHtMF5tKbkEfU0derDXt2egXo4+CXl9+Z3nJoex10UiXsR4rHe/2j+5TkbalMC0hSB2hDmC+g0GXBYYaznUK0Fg9Q8IDW7RFDoNMQgNfPZaJCfyVUoIExuPZ/8S2o+UJsycGrJcOrRH2vRJ00OnHpknA8cJr8WfKchgfNTfecB02uS0+S+Uw/+WEssVgxSi2y/odYXpveLLBZb50nvn8sdArUWwVhLhtoQJjdgGIxNzsaA2pQ+w4XZQZrSUGveJ7VoOLXwc7lK6TuTPmKgTnHKsBggO4PUI9MvmPBh+jU509N3pjjnA/Wn+jJZvOE0pTGy4tqUBmkKpicbA2o9+ITlBpYj6rnvNJT5meWT3/Fb5o9MRj1Ch+nclP445SYRqBO+1Cf1zBgnOyTfufo0IBPOP9OXn/LTyPjUUGOsLwHzz5VzZ6Z3QGoBXnEdDGfKCULg1Gfwc/5KjJv+ONl1hiqT3ZQ+mXh2eZExNxzm2yZjvGE8CxiffypXoYZaiy+xMAvUJgNqQ8FYz4IrNvOAMP411B8nWaLB+EyYXT/H4ZrDG8r0ZjgyfwfX+GL6zcBLngdqLQBSz5gNgEz4/0zuxBljwqK+MDwC0mTGdM7kQ57Z7jPOsHG21qnPLJZ+R+6EF8MTqoyfk32ScY3BM/MPVOsZ47IxzU18GIHaZP7P/cYHDovRejAIi4WJGzOosvfprAlryHjNfMpwYXFH6svv+K2EE09Z7mpyf2S8r0eWgxiPJ95N3LjG+BQzjG8sLn4exzm4xv0w6aJe/QdIfTacJjOm3NYULBZ9MtXsM4sPQ/29/LAcoTrlyBmLA5/lK/XaA0CV+XHi8Xnim1ML8Fr/WY7Kgp/G8ZLlvxycf1wbLC87R+KcRpUpb1VfAI4hbVeHc6pqZ0NdXt7UFP0gGCoVjUGh6cai0dTzzMfvexnFB85ynhDjYJb6yOqjKS6OsWQNvkuPycaQt2swhJ7V+KLe/Ua9U02nWZvo4ljf1bV/yH9Vi6faartML6sJSkpjUh9+LHspArVRrCkfN2vLaTTLaVaG02iMc5ba6KxusHHTaVbwWptWjD+A6eTUokUa3SKNYjiNav3Mfg/z4XrBbJ1vtZ6mtrIL1vh47StZL7X8se/WPU1dWkBCdVhYOizQHJJEg4U/wMK8wMJSINkKsNBX0xjBK0iQCMlWhIUxgyRbQbKUIPElSMwZLII1LHbKb2Cthd4O+q5AYb74eW/36olFPISu3kEC1pDEIyzYWckakkSHxFpDogmQaCMkgQ4L7QKLYDWtm9aaAywCDRZoBgnTF43XNeZ59RM8pz5Lx6PvJhTmCpn6WBdk0Xd94gu/17QKPSuLVooTusnR9ywhLlH34gvWdzXxOqNxKbAY+M4XrorO0PPHrYZnyRofgzUuXvbiWNSrwPktjinI0Y0DFnG+1QGNq4DGuaIknlUH7py/3inoKfqJra+4rUQbi8blnO0RA1t58dVvcEezIBobEonCOZIAjfP5W38O54OlzR1YAZ7h+FiCU+QpJ+bPx3Ix+hVuorV5jKRd9bhSNIcasu8l48/WvdyNXmP8bZ87hmttAE7ghZ5VIwoUy52TuKLn73FQMjjFWj032F2ITHWMTL3NtYdjNYLVwcuXPpLlXdYvsDo99T3O1FO+wccXDRmut3JANBmMSxmISA6cpRy4mhyUSAbrrWw4hWyQQg5UTfYdJAeqL/ulJhvqQQ7WSIaO+ba/X2MKyYHxd4DlLoNlQCBRSkgOc0iWLC4LSIrzdQ0uYbkrIPFnsMQZLNEACVsff3MfVFgNmrPaMd31WH/I6hazSWW90tTLTPWb9Yng2jvMA1Yv1HoIWD9Kpv7mjf3QNeSAmDJwDNkfTdl3DhMWRunLgYtkY2R2ItkXkQzZu6PJUEWyocayP8bTWECWb+1XlzwkWQFLg4elXsLS5CHRRFiaM0i2IyRKAUvEw9K/QLKdQRKLkBxGSDQeEl+c9hHz8k0NmbPeM1Cney/rH8bp/utM76zvZDWdgKlmN9m1ftciuxv7pD4H7K4xNjn8pp8xHCQD4svQMWTAcJhsZHYxv5syGLeyLzKbtzJwYhmojCsH2Xd82Z9wY/b73/hfJ7DUc0j8+ZTDSDGHZFfCEp1hqZ0h8XlItszWEZKDAEttgARdILFKSJazab7UhG/9D9QmN6596mXqldk7YbV/wkEyrn8L4I2XGGA9HsNr4oU69ZWsr3nLfyeWjXEpG8w+EcmGa8oG4/aa3Zlj2Se+HJTahIPBYkU1J76DkfGmkEHJOLL9xv8HEZKEQKLnsLQoJDEPiU5haYyQGGdIQA5LX7zWgXiAZDtAwjizFSBRCCSUTnvf+p/dY1gcE2Oc+iFh4oMzxfwMjE3xch8VpvspiwFm99jkU38/jbGe/a39LMaD0pfB2pQD1ZSBaky2GSwOSiT7ZCsbJRvXJt+zfBGoy4kfwNnKgfOj+AcZJPH8yunl+csfm8wCb2w0O5g8trFG1zYCCtbQNPdoNsBGVEvdRjV5fbDFREl4ujLdZIcx3UVIUPbCYTQc5bPPo4uhBipwrcKQNB7zSe56iYYw3dviIrTdTPT5uYIQNlbFzjK9ZB0WGDtot7N47YIRVhIpMXwCYOhaXrQBoTli0RcFkvBZ7fNzEBZYcrClp0hApkch1goei9MPB7LlxXs2l/Cv5xolQoKDvGQXCN/o4fYrq8zc1z8UuDTbp1Tf2uUltMSsDjRDCA+Mz4oUiIkeIkExtERFkr5BPM0N3rIstFMQxorpWDuzsCTTS6qAx4+mu9iZhW5Z6nb0ef0c69hxMW5dZyv6PLVWhSD4ZNeaQgMfxbkO15qEvVoKaZOl1XJwS5BHEigMrbkk/K72veYU8o2ERv3o88IpwVspUJdtjBsTapgPdVxGQrH36S6IUA/iof+MxN0qccEJUMt2i+3MGJO5gZWtoXUiEHGfIJM3NrqcagvPGLPPlrC7AGKByMUisBcNdvkRexgEZiP7vK4/jnrtaNTBJV4ZQjEz1snnMO9GCwd+rAXHGGdhUMxas1LOrrNrgWPywJ1JcQWgUXSDve5Pjoo/O55upqV+XpWZFvHYjYTAcwvrbArKKi2DU+JuZ0jIeFNcYAvNO1tv8gBd2sAF+5BfqLYHZvbG543NTgeuvoslNIYI7IGK+KiK90CneYr8U7jRe2fTVA4Cc0s7jLbW7xKdVsZ6lyc8DfBagAGfVI+SBcEIFLdKMF5TK+D1i+3gMhABQa5AsaDzybkZDE8bTTcBZqErlthUAcmkQAykhLeU6ccnoiAT69tHfqfYXqJYml6YZQJxkVlAw+tA0LFbdLxrL3hQHc4RAacVzfjYwQDw2mUv8qekXBC4STDCVMN0ew6LnR5JiWMjHUeVKcXroHT07RDiZIDrC4/5ZgzRZWWU1u5xTC6hllwQLvYO2gWpFmgmBquAn7tmoQMHGQP0miCiwdkvEitxt6NdzqtQ107+sCgexaCFeqAbJKj3I4ApUURDXDxZxaI2NEtxzs0ky9a1mVnoJdTwykSCapa6kvBYesGgMwtdSnhQuYg+JgJdmVTHtqZLlpe4X+xCxU4HmwTZiOIVLQboWcQaqezSbMf0ckpaYPEyuoUhJCXoAwQ2UTE7uzgpIu3SO1WQu9pO9Medm6JL/71ds30gZnW4NkfHw4FBKO/z8TyljW97+Ic/Qn77w6CJdd3RdpaJLBbTKxP1lWE2bcJTklaBblfmgFxMsGZKtqhvDc8iKTrPXG3bAm0x7AUwC6Xl2ceZl7jJ58C9PIGC4rjazizVak0hC02e+mDUTysSCHYFSKIlxNKtEaJ+wNrcD/n+nG7oJVCxCl1axJv6jJ3MicbMeZQwQDh7ispsYxXbWeCimYkBTLXuhFHAB2K9t9YYpVq/9ZG1tsSdjnAjQwwek9EcQrEZIiTkWNIbu2y8ZOhRgnZu5HYDKvEaeAD7EriYgn92VOsc050LPX0eH5oMF4vQWfVqIDQqKpvaR42NN0kdSkqBpOaCSsuKpaXku2DmFPo2ynser3vF2dCLLyVKRKzCFmM+qiwx3lDTxgCvSuMUbTCIhHpmjYVgaNnoeMnTo0CRL9KdhRordfHGGIM6Ga2VPyx6xB8Gq2hcVALX2gAPF0EWkPiE15ZtrcEszLt9LBYXk+pjSvXeQJcu0oQzcBPJdPj9y4/kulOYv1ED64/f/uhi24+f9ppvf1pa4GPYVh/Cc/ehS+M27bsyrMJD2n44drdp2PW3woeFJD3MRWHxsFgsXlZ9yKs+bauQforrsqm7tJ0+77nt6lM7K16Os5Fir6ztk7OF4JOxBMv1y5cBS6D+n5/cHaMubvOmz+vq9mXLbVyXZVglt4Xp03rx5XzfdjTj0wbaDlga2seuDw95dbj9ovvtF93vwnN39/Wl7qJjTpO7uj18i5u6tT7ep318/7Lmq4QvJ2orS3Psr8ZqQH2CW+B8Qtbjx6zvm+7D/f2pidNbPhEkYT6TeHk+W0RCnNwuxkv7MM5Pd2/RuPuKxh3beBeW4VhXLwrfv/7G40d6fTdw19cl/fGnH38tapL/58tLSGl9TpNPSV2GedVxH7m/cu/6NCxfw/Pu37h32TG6i9r0/O34uW6LtP1+ivtyQhxyH7l3P9Y6Dm/jtr9r0vLdzRftrgL/af3+n+nx21/m/TPf2F1uuyyl9Mrg3/rI7l/uo7y6j8Iuu+nSnrtNjzXX5E36HOb0pquPbZz++JOemzTOau6dnfZ9Xh24buj6tOSyuuursEzv3t3c/JGz057rs/S7yZsv/xf3lOvS/vbLO/enbwLpfxQU12wRMTjyquvDKk65vuasDbjCYaWHvOvTdsLk64pz3mfTmpv7Y9fe0zoO6aRJeO64twHKHdL+9jp0ewrpMeX+F4vKL0N5wv3pb7+XCX/l/s6Rz9xty727s6d9dt/m1eEd9+9X614nvU8vB396SXp3pKurmy/bf7by3X9RGPd3bkK8Lbnb5/+qAjc/SswvH6pyt7fhsa//JxFHTRtaD4w2rLBxYZVwcdr2+XMeh33aXclzXTRR5yV3cKvl63V3N1HYpfKMu024W+4vf/kL96e/ffOV26/cv3N/+tvrEvPrq7zzzSlfMtPvnfHm84ofnvAi6PfOKdLh/yIG0ipp6rzqb48tZWHwk/L46w/C5of9yu/GypuO5G1wvJ5691urr+z/CuhPsGPgMOxexckPDv/vQvobTbE/2Q60lmvt432Snu6rU5kKlXBjO0tHuzY3p7C9p3n0fYPzTWk5Nv/gSNfXbXh4VV6OzZcxrq6+rru7yZ+5f+EObdowLnw581fuvmnr+L6sj1Xf/ZnRr7rhuD9yWtUd25TTFJvLO+75SOnAmpYqjfs04Z7ztuvvbjjuuW45Z2toFpdX3N/4uzuJ53/9M5fUU33Pn7muD3vuT6+M/3oG+xe1aXhtWJ/z61frNE0bTrjhuKSu0ptJlVWWxgWT5en29L39S/HMOy6kbRomA1eGScrUmWy8PHef8uq5/q1jy+K5u7s8d2/mbyYVpvOMsPiaUW5f4Rz2KZfkbRr3dTuwo8q86/LqwA4uiyRvudu32F7FLZOE1bypx3nu+jCa0tkEONt59eyf/vZKl1/feoipmqTP4ZH2Hcdz/Dvu71yfptxt+Eoo04GJfGvUpICVMjra2mNeHS/XzvPSd+zsNmVMSeO64m6tE/eFf9dtjEuv0G7SdrK3rqatcVaf2S7u07dIffhu5Aeg4LTNn1m2C1/6oRfG5h13bvM+jGh6w3F9fYyzN7vv75q2PuVMjbw6fIoZNZghUw743YXP+X+bfPBPNJJvoj1tT3n8pQIuE3Ls+n/M9jVHWT9VscgPuaqubllLlYRtwjV121/xzjuOpl3H0bxI6cA2RenNH7kuDqsqTSZ2Nm0dpcndzR85B6rw/yuzcEjS6v//wLkpV6VsURwzEYxAbR6zpqNjZzJXVmnP2n6OpqeUcmHPdXXJ5E+16N+46Nhz55SF97/2XBaeUi7vuTY/ZD1X1ee7m6+RNHH7Sr7k5b/fJcbbsMnvujou0v4uub9hUfHPb6tPadvmSXoX19Uzq2NTdj5Syv3lL5wG9Zu/2tPS/7x5nMC1+zYNy49v3xbvH+Qbtvh6JGvjkzAt6+q2TWkdJsxdT23ahO33ueVfGZBl3afc9b701cuTL656dnevJJdhV3yVct3zH8Ldy65X69KKBRJ3e1vV56/rr0e9bHtB4ff2/AC47yLp9vYPN/87AAD//3gWRYyLNQAA" -> "H4sIAAAAAAAA/9S7eZObSJ43/n9FzHtgPR2xu9GrKg4JW57xxgoBOsksjkwE89twcJUgSQ4DOqCn3/svEpXdVbbbPfM8zx+7jiDcZOb3/nyPtOhlVXZJ2U2cvk7ec8WJdlkdNN1DkV2T+C9cWJ3KOGj6D2+MjaEpEAF1YXlv7tjbBCdNm1Xle0645/9096e7yeTloT/dfeatZm1dtVk3ng26LojSIim7v3BPGU3KoEg+vMnKrLuPno5vfqNymqBsn5JmopVRFWfl8T33Nsy6FwdGlbvk2j1EtDrFk6gqn7Ljn+6MrEi+Ue7PL8/c3Z3apGnf33HchGMavOeSSJywxTuO47i2TT8Gpy6tmmxI4o950o9n2Z8J96Zt00nTBtxisVgoEhiCpdBHosZe1YW5UBaLxXJhLq/kSd9s6OppWc6ziK77wm00pXGQSPdyl9srR0jqt/HycbgIxJPdMjXp48Gok8cmA1dwoKt3kQvnD5ZeKzE/zPUL6H/On47p/OnUA2863/xsBDLsHawcZymo9OuTdVjNsnUXPdgmLUNNz3a1nU9pVldT0++UrjguPh1zeyGrQ9ofQ/k0M+bZ1dlcp65CTrbBrw7mAEidPPWZe/q53Vg/pyJqzHy3UE6njWeGDaE/6ykugv25OfcOFE8t7M6lp5A0fLz08K3oPpKg3sUP89QJPj1qwkXvZaSL5SGaPh4v/DEzQ7nNQt0Z3gInubrSzJy/+1Sb0DW8XVQf/YbawXq9820j7Qb41oj9Bu51dKhsYZEs+ukx7SLQQMWh4cw+P76VhoH/pFi6GC3hFPKXena5fHpMzxex7EKpdvaPXZx025/xjDcfy7o89LZd+rU46JcoEYXwcJXflumclum+8Y8keRtVZvm40K8PEZVkzd72x+z0GCmXn3PhnXeinnFAnwKlyy/bfW4RtSbOQUxmxlaQK/Vtu11H0wd3lvdP+3NstDiNPwnLw3qFMayH6hjy8xn2Mt466HXpWw9Cgo/LB+tnF/ed9+S945snDKN4UYkr/6nczgbPQoftdm74eVBer5L2FsEs17Zg3iIi8vwgL/ue3zxtPjnhVlBmT2+fYimIrGY/VSMPxfrmQVB64Mq6QN5GfrZYwe0OhMNB5x2pe3p35RPB/PCBKwJSNf/VJHEadPdRVbx5jfckFmczYT5ifnnDPPXVjQAcbcbWNo+KQHQ6rWXdUbLr2pEvMJcP70ry4L9Nqkdgag8Gf9lN3812XBWe4iB7Jezu0mRd8pFVhOe0rIMufc89dEV9S++PrEZ8PAdNO2oW3arAe+7vz4pCW0GbvfpxCQ1j43x4J0XB0zueT2biTJyGU2H69PZpFj7NgoSPpWguiNG7uTAXn6mX0HiEtmZ9Jp+HYjyTZ7Pp7O1MlKR3b6dCKCVikARP795K8ttElIJ3Yjz9Wvji41KznA97m+/2trC0ULx1MkW18BbZyN+avI6scY/vlrmwtZGlYQ2opusffF6XbLRVfJ5ipALTEL0BYGWF8pkQij6fFMbMUXPRWqUoFC0l5i3LRfU+FOptsPaJk+uWhS47k+pKzPufLIyBmdO16ejYQroU89fM4Ge1r8dtJNQqOPgkdIFkr1Li5MIn8xA/Yg3LDrb8BAkadsAhWAHoHGolvtRsb/pqL9cPDt5aMY9LF1kuwrpmaTofF0ZvEz3FUto4K36W4Fo2eaAgnkqWrvt23p3dnFZxAeBy1Hm7REjXfDHWkaZr41l3rrJ3M9eBWSqNi3XPxsDwhnTvujVAmJZJqVgQAcUQtnujiDeWqly9gz7E5Ljz8Jbg3BABNWZ+nl4thK4BumJXeycZ6tZKCB4Csa4Mqb46a7pGJJUQ9c57EWwNd3ONiIITXDsefw0MIZIwrnvzUvFAtQpPqgbnQKehDmQsYB8JSmnmdB+sYgWu9S6itW2488JzrT5ZY9tZdkOY+5rtdlNDihpv0Hc+xiejAK2hx/WSYt5Vt2tL8FWLxsAR9bOfW42rY9Uq8d5exzvkxitnbQ22BgLXBUVMY9fW6wDk02nMxxeD6oHrbGbekArhQflk4MUOaX7rasbUX+mBowmpq9PMchRgHyzX0MDGLhXJ4unFK+kpxBSFy26wSiyGqnXGK6FP1tU5OaRypFkizoXHKNe3oVlPQ7GVIoo7vMa5tcI6ErZLR4wVA3WChwQbr3FqHxQrHLZ5KPnX3bC4WoU3mGjaYwSUmMeK6eoQa8LKOsQbhKm2pL5taPOlSalu5ZXkO75nSPnFX83byJ7vPOrXXk7rWLROSFg0IBeWUIsVA+PcPsSWi4Slh/SVTWIK6HFIHCUPxcvud2iVz7TWIdbNbC4h5AMTCUvT9abfz6vrF4yax1qxyloEIqU2H81Cvd5H+aZ3XCEINP1qa9RI3GvqSNSNnEiyBrp08BZZJbi4JeKN9UayBEvyeKuKi6NgIXC2dT1bFtcmdhQPoLnn85borsEyWs1X9norGlr3aLtXBwh4Zxy8C1i1Z5vS0l1HTbiqEV4bZ3ioLyFJbVxcu2iNzhYvPDoO2iF3u0bLDgYEB9GAC4v3D4E2lRxnIyC3w1Dd7sJ1Su1cb9Eh3ZjiVUUrPEU5AJ6jz8BhIeHVrISqsrdpzCdYMaFZ80iMgVkuJICx7bvveIDQFGl1b5eLIVjTM9C3U4i3liV2feIC2z7EhZmnYiClwC78UyQakmvPReBSwSJpl2iCvCSA9/JqtuPrmYV0wV5XVy+PhQgBbyfpO4QtFC/nVjh4fZzHBw/lMyT4e48aUw+nhjlsISh1Erjba0TQ1CeWZufmzi5B69jvpGgNZhHRz+Bg8V6+PQGaC+bBmC+zW0220EzbaEBH1NpaOVVNbOm3Ws7vvukUrNCbIu7jFS0CF6TxCsnLbHHcLBXNO1gpPFbHzXJxe3SfRiWoQ3Eqb1TjuFOVqZHluy/7S8XxD9vacy9Hp8SdV+D+Ff3tEQ21mkKnmnpDdTGGmgKnLsBQ52CoeKjWuTdUV2OoBF+tBs+pLh6pZmB8r3PfqVPfqa6AVFfo1Bl4pR+ofXGWxmvc+7aihKv4HBWUD1a8vFmDynM2AqBxHa9SG/G6HhagTw4KH7jz083m22MfwBC7uIeZojpEOEfiVgjca74v5r1/eeWPNFzRPDhYs5f046PNzvFSWfquf44KJG+0Og2zxdVgj1r1wKl6uFz0hrq5brQY4MXXflJgKJlH0/V5/7A5wkzZee70aDgL9sgGQbJBjkeDLAbDVtYONl/FIXa3n3wX8DBTaOjqdajpub/e0kgy5qEEstilrb/CfcQrve9alXcwT544717agSScBQUm8VIxY3fbBq5xtEU822j05Bfv5G9s1hXBK6611yt7/5AfTfdahtKW+buDmdJH4u/7/IXuNuK1I1rjLFxRskcdTZzquFM3F6Aej15B+Z35DabGx3HneexehWiodt/bf34uhloXgNS5r9aExQI6dQoc1hirGVQrwSAVD0jFLhEUOjUxSMViNhjkR3wVCgjjW83G+JKK99W68J1KMpxq8IZK9EidAacaGOZ9h/GvBM+pie/8UN+Zz/Qa+dSZ51S9N1QSyxWDVCKjN9TqyvR+5sVy6zLq/WO+va9WIhgqyVBrwvj6zAdDnbE1oNaFx/zC7CB1YagV75FKNJxK+DFfpfCcUR/RV8c8Zb7oIZNBqoHp54/+YfrVGdPTc8Y85331h/oyXrzh1IUxsOZaFwapc6YnWwNq1XuE1QZWI6qZ59SUxZnVkz+IW+oNjEc1QIfpXBfeMNYmEaijf6lHqqkxjHZInnOLqU9GP/9IX36sTwPDU02Nobr6LD43zF2Y3j6pBHjza284Y00QfKe6gB/jV2LY9IbRrgtUGe+68MiIs+szj5nhsNjWKcMNw5nP8PxDvgo11Ep8zoWpr9YpUGsKhmrq33wz8wnDX029YeQlGgzPhNn1Yz/canhNmd7Mjyze/i2/mH5T8FzngVoJgFRTZgMgo/9/xHfEjDH6oroyf/ikTo1RzhhDntnuMcywdXbWqS4sl/6A7+gv5k+oMnyO9knGLQcvLD5QraYMy8a4N+JhAGqdej+OG+87LEer3iAsF0ZsTKHK3kdZo68hwzWLKfMLyztSXf8gbgUcccpqV515A8N9NbAaxHA84m7Exi3Hx5xheGN58eM8zsAt7/tRF/UWP0Cqi+HUqTHWtjpnueiRsWdfWH4Y6h/Vh8UA1bFGTlkeeKxeqbcZAKosjiOOLyPenEqAt/7PalTq/zCPF6z+ZeDy/d5gHdJLKM5oWJryRvUE4BjSZnm8JKp2MdTF9VVP0Y+CoVLR6BWarC0ajjPPbPh2llE84CxmMTGOZqEPrD+a4vwUSVbvufQUrw15swJ9cLBqT9Tb3+l3qunUKxNdHeubvvYb/xe9eOyttsv0smq/oDQi1fH7vBciUGvFGutxvbKcWrOcemk4tcYwZ6m1zvoGWzedeglvvWnJ8AOYTk4lWqTWLVIrhlOr1o/sP2A+WM2ZrbON1tHEVrb+Cp9ucyWbpRbfj92qo4lLc0ioDnNLhzmaQRJrMPd6mJtXmFsKJBsB5vpyXCN4CQkSIdmIMDemkKRLSBYSJJ4EiTmFub+C+Vb5HV9rwWELPVegMJv/eLZ78UQi7gNXbyEBK0iiAeZMVryCJNYhsVaQaAIk2gCJr8Ncu8LcX47nxrNmD3NfgzmaQsL0RcPtjHlZ/sCf45yl48FzYwozhYxzrAvS8Js58RnfK1oGBysNl4oTuPHJO1hCVKD2ORZs7qqjVUqjQmA58E0sXBVd4MEbNhqexit88lc4f6bFkaiXvvN7GFOQoxtHLOJsowMalT6NMkWJD1bluzP+dqeg5/AHtr7AthKuLRoVM0Yj+rbyHKvfwY5mQTTUJBSFSygBGmWz1/HsL0dLmzmwBDzz474A5/CgnFk898V88EpchyvzFErbcr9UNIcasneIhx+de74bvfTx13PuEKy0Hjj+IThYFaJAsdwZiUp6+dYPSgrHXKtmBrsLkbGPkXG2uc1wrEewPnj9PEeyusvmBdanx7nHGWfKV/7xREOGq43sE00Gw0IGIpJ9ZyH7rib7BZLBaiMbTi4bJJd9VZM9B8m+6sleocmGepT9FZKhY76e71eYQnJk+O1hsU1h4RNIlAKS4wySBcvLHJL8cjuDC1hsc0i8KSxwCgvUQ8LOR1/dBxXWg2asd4x3PTYfsr7FbFLZrDTOMmP/ZnMiuM0OM5/1C7XqfTaPknG+eWU/dA3ZJ6YMHEP2BlP2nOPoC6PwZN9FsjEwO5HsiUiG7N3RZKgi2VAj2Ruicc0ni9f2qwsekjSHhcHDQi9gYfKQaCIszCkkmwESJYcF4mHhXSHZTCGJREiOAyQaD4knjnTEvH7VQ2Zs9vTV8d7L5odhvP864zubO1lPJ2Ds2XV669+VyO7GHqkuPrtrDHUGv5pnDAfJgHgydAwZMD+MNjK7WNxNGQwb2ROZzRsZOJEMVIaVo+w5nuyNfmP2e1/FXyew0DNIvNlYw0g+g2RbwAJdYKFdIPF4SDbM1gGSowALrYcEXSGxCkgW03G/0ISv4w/UOjNuc+p1nJXZO2G9f/SDZNz+LYA3nnOAzXjMXyMu1HGuZHPNa/w7kWwMC9lg9olINlxTNhi2V+zOHMke8WS/0EY/GCxXVHPEOxgYbnIZFAwjm6/ifxQhiQkkegYLi0IS8ZDoFBbGAIlxgQRksPDEWx+Iekg2PSQMMxsBEoVAQulI+zr+7B7D8pgYwzgPCSMenDHnp2Co8+f7qDDeT1kOMLuHOhvn+3GNzeyv7Wc57heeDFam7KumDFRjtM1geVAg2SMb2SjYujbGntULX12M+ADORvad7+U/SCGJZjdMLy6f/7HJzPHaRtOjyWMba3RlI6BgDY17e7MGNqJa4taqyeu9LcZKzNOl6cZbjOk2RIKyE46D4SifPB5dDdVXgWvlhqTxmI8z9xBrCNOdLc4D201Fj58pCGFjmW8t8xCvghxjB223Fq9dMcJKLMWGRwAMXOsQrkFgDlj0RIHEfFp5/AwEOZYcbOkJEpB5oBBrOY/F8YcD2TpEO7YX8y/3aiVEgoMO8dYXvtLD7ZZWkbovfyhwabpLqL6xi2tgiWnla4YQHBmeFckXYz1AgmJosYokfY14mhm8ZVloqyCMFdOxtmZuSeYhLn0e7013vjVz3bLUzeDx+iXSseNi3LjORvR4ai1zQfDItjGFGu7FmQ5XmoQPlRTQOk3KRe8WIAslkBtafY35beUd6nPA1xIa9JPHC+cYbyRfXTQRrk2oYT7QcREK+c6jWz9EHYj67hMSt8vYBWdALdvNN1NjiGcGVjaG1opAxF2MTN5Y63KizQ/GkH6yhO0VEAuELhaBPa+xyw/4gIFv1rLH6/p+0CtHow4u8NIQ8qmxij8FWTtY2PcizT9FOA38fNqYpXJxnW0DHJMH7lSKSgCNvO3tVXd2VPzJOehmUuiXZZFqIY/dUPAPbm5dTEFZJoV/jt3NFAkpb4pzbKFZa+t15qNr47tgF/Bz1T6Aqb32eGO91YGrbyMJDQECO6AiPiyjHdBpliDvHKz1zlnXpYPAzNKOg61121inpbHaZjFPfbwSoM/H5V6yIBiA4pYxxitq+bx+tR1c+CIgyBUoFnQ+vtS9cdAG042BmeuKJdalT1LJF30p5i1l/PGJKMjE+mbPbxX7ECuWpudmEUOcpxbQ8MoXdOzmLe/acx6Ux0tIwHlJUz5yMAC8dt2J/Dku5gSuY4ww1TDdXIJ8q4dS7NhIx2FpStHKLxx90wc47uHqymO+HgJ0XRqFtd0P8TXQ4ivC+c5BWz/RfM3EYOnzM9fMdeAgo4eH2g+pf/Hy2IrdzWAXszLQtbPXz/O96DdQ93WD+NVuADAhimiI80crn1eGZinOpR552bo2NXO9gBpemkhQzUJXYh5Lzz5ozVyXYh6ULqL7WKBLk+rY1nTJOsTuZ7tQvtXBOkY2onhJ8x4eLGINVHZpumV6OQXNsXgd3NwQ4gJ0PgLrMJ9eXBznoXbtnNLPXG0resPWTdC1+9au6c4X0ypYmYNzwL5BKO/x0SyhtWcf8Hd/hPz6h0ET67qjbS0TWSynlybqSsOsm5inJCl93S7NHrmYYM2UbFHfGAeLJOgydbVNA7R5vxPANJAWFw+nh9iNP/nu9RHkFEflZmqpVmMKaWDy1AODfl4SX7BLQGItJpZuDRB1PdZmXsB3l2RNr76KVejSPFpXF+ykTjikzl7CAOH0MSzStZVvpr6LpiYGMNHaM0Y+74vVzlphlGjdxkPWyhK3OsK1DDHYx4PZB2Ldh0jIsKTXdlEf4r5DMdq6odv2qMArcADYk8DVFLyLo1qXiG5deNBn0bFOcT4PnGWn+kKtoqKuPFTbeB1XgaTkSKqvqLCsSFpIngumTq5vwqzj8apTnDW9elKshMTKbTHiw9ISozU1bQzwsjDO4RqDUKim1pALhpYOziF+3AsUeSLdWqi2EhevjcGv4sFaev28Q/yxt/LaRQVwrTU44NxPfRKd8cqyrRWYBlm7i8T8alJ9SKjeGejahppwAW4smQ6/e/6RXHdy83d6YPXh6x9dbHv/cad59seFBT4ETfk+uLTv2yRqkq4tgjI4Js37UztJgrabCO/nkvR2Jgrzt/P5/PnU+6zskqYM6MeoKuqqTZrx855JW52baf4szkaKvbQ2j84Ggo/GAixWz18GLID6fy65PYVt1GR1l1Xl5JlkElVFEZTxJDc9Ws0/y/dsRzM+rqHtgIWhfWi74JiVx8ln3Sefdf/aPerG+vCQdNFD1YanjMZfH7S1paU59hebNKA+wg1wPiJr/yHturp9//BwrqNkwseCJMymEi/PpvNQiOLJfLg2b4fZ+f610fdfjL5nhPdBEQxVGVza+6gqHl5+yvE9vb5ZuO+qgn7/C4+/5RXJ/vv5JaC0uiTxx7gqgqxsuQ/c37g3XRIU988c76vm+OY/uDfpKbwPm+Ty9fqlavKk+XaL+ywhCrgP3Jvvax0Fk6jp7uukeHP3Wbsbw39av/9nevz+B3j/zKd010mbJpTegPp739L9y0OYlQ9h0KZ3bdJxk+RUcXVWJ09BRu/a6tREyfe/3Ln7M7dKOq5LEy4r2y4oo4TbqPd3G2A7C7DUPm7UDz/9W3RqKDfZtxxD5PuHB0Ge34uz6f3z3w806JK2eyiSLpjEQRc8fOY1yeJ/ZzIWbZsUIU24tGq7MiiS+zsd7fe/JdSbn375Ksd+nfz0ywstfr1/RvANlC8DwwQ8NlnZcdXpZkqZXF5ISqK04t7YSddl5ZFr+7ZLii/bXFdxP/3ySplf70eW9rNfviK4v/v8X1FHuTbpJl9Y/fSKzf+O+D8751YJQ+agLzjoKs5ag5szrOSYtV3SvEbKJevS8czdw6ltHmgVBXTUJLi03OuqxB2TbnJbmpwDekq4/4+Vos9LWcz99MsfVflfub9z5BM3abg39/ZIZ3dNVh7fcP95s+5lQf/4LPjjc0G/J21V3n0m/9HJN/8gM+7v3OjxpuAmT/+oAnffazrPH+Fyk0lw6qr/TcBRk5pWPYMNa9pcUMZclDRd9pRFrCbcwHM7NELnOW+55eLlufu7MGgTecpNYm7C/fWvf+V++uWrL/h+5f6T++mXl3311xfF9ispn8vEH8l49enIdyU8M/ojOXnS/1/kQFLGdZWV3YSV2Z9++dFM8Ot30ua7s9gf5sqraet1crzcevN7p2/o/+LQH/iOOYf57kWefEf4/xTQ32mK/dF2oLVYaR8e4uT8UJ6LRCiFO9tZONptojsHzQPNwm+nuq+azan+DSNtVzXBMfmtuZzqz2tcVX45d3+XPXH/wh2bpGZY+CzzV+6hbqrooahOZdf+hcGvvOO4P3Na2Z6ahNMUm8ta7ulEac8mtTKJuiTmnrKm7e7vOO6pajhnY2gWl5XcL/z9vcTzv/6Fi6txqMmeuLYLOu6nF8Z/kcH+hE0S3Ibxp+z2RT5NkpoT7jgursrkblRlmSZRzngddHv8fwmeW2fWcgFtkiDuuSKIE6bOaOP1qf2YlU/V74kt8qf2/vrUvtq/G1UY5RlB/qWiTF74OegSLs6aJOqqpmeiiqxts/LIBBd5nDXc5LVvb+wWccx63jjYPbVdEI7lbHQ4o7xF9qdfXujy6+sIMVXj5Ck40a7leI5/w/2d65KEmwQvmDIdGMvXRo0KWAmDo63ts/J0vY3b165lspuEISWJqpKbWGfuM/5uZAxLL7xdJ81ob1WOpFFaXRgV9/FrT73/ZuU7TsFJkz2xahc8T0PPiM1a7tJkXRDS5I7juuoUpa+oH+7rpjpnTI2sPH6MGDSYIWMN+MODT9n/mHrwj0xP38v2pDln0ecOuIjJqe1+2+0qjrJ5qmSZH3BlVU7YSBUHTczVVdPd/J21HE3alqNZntCeEYXJ3Z+5NgrKMolHdNZNFSbx/d2fOQeq8N+KNOjjpPz395zLpmB2KIoYCwagJovY0NEymbcpuWN3HY4m54RyQce1VcH4j73oP7jw1HGXhKX3v3ZcGpwTLuu4JjumHVdWl/u7L5k0YvsGvvj5728K4ySos/u2ivKku48f7lhW/PNk1TlpmixO7qOqfGJ9bKzOJ0q5v/6V06B+9zd7PPrfd/vRuXbXJEHx4fXb/N1b+Y4dvolkQ3wcJEVVTpqEVkF8u00kddB8W1v+lTmyqLqEu10Sv0R5jMVNz/b+BeciaPMvXG40/yXcP1O9OJeULJG4yaSsLl/O30Q9kz174Y9ovuO4bzJpMvnT3f8fAAD//6fB9ZtnNgAA" # forces replacement
      ~ vpc_security_group_ids       = [
          - "sg-084607083aaa39727",
          - "sg-0eb65fd8f2c17dba5",
        ] -> (known after apply)
        # (4 unchanged attributes hidden)

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
      - ebs_block_device {
          - delete_on_termination = false -> null
          - device_name           = "/dev/sdb" -> null
          - encrypted             = true -> null
          - iops                  = 150 -> null
          - kms_key_id            = "arn:aws:kms:us-east-1:933752197999:key/9630f91f-f3c0-42eb-b65d-3defffc79926" -> null
          - tags                  = {
              - "AppCode"      = "IMGB-001"
              - "Name"         = "🏗 Internal Composer (staging)"
              - "ServiceOwner" = "Image Builder"
            } -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-058d1cec56397f102" -> null
          - volume_size           = 50 -> null
          - volume_type           = "gp2" -> null
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
        }


      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/sda1" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ tags                  = {} -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-08629895a40842f34" -> (known after apply)
          ~ volume_size           = 25 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
        # (1 unchanged block hidden)
    }

  # aws_launch_template.worker_external_x86 will be updated in-place
  ~ resource "aws_launch_template" "worker_external_x86" {
      ~ default_version         = 9 -> (known after apply)
        id                      = "lt-04e6df10bd74694e7"
      ~ latest_version          = 9 -> (known after apply)
        name                    = "imagebuilder_worker_external_x86_staging"
        tags                    = {
            "AppCode"      = "IMGB-001"
            "Name"         = "🔧 External Composer Worker (staging)"
            "ServiceOwner" = "Image Builder"
        }
      ~ user_data               = "H4sIAAAAAAAA/9RYW5PiOJZ+J6L+gze7I3Y3agFfMCQ5nR2DweZqGcuWfJndyPBFYGNhO21x7a7/vgFJ1mRlZe/07PRL84Skc3SOPj5954hhkTOSs6Z9KskDt91RlpZBxdrb9Ejiv3BhscvjoDo93ulTXVUMBEYD6N01LqMmJlWdFvkDJ7T4T41PjWbzrdGnxuveo7QuizplV9uAsSBKtiRnf+FWKSV5sCWPd2mesla0Wt/93cuugrxekaqp5lERp/n6geuFKXtjcE2ZkSNrR7TYxc2oyFfp+lNDT7fku+R+eGvTaOxqUtUPDY5rcpcMHjgSic3LZIPjOK6uk6dgx5KiSs8kfsrI6Wp7+TS5u7pOmlUdcIPBYKBI4BwMhVMkqpfhaGAOlMFgMByYw+NmpU2ndLwa5v00opPT1qlUpbKRSBddllljWyBlLx4uzwdh43WdPDHp0tVLsqxScAQuHd9HjtFvQ61UYv7c1w7g9DlbrZP+ancCXqc//awHXeNkY2UtJ6DQjivojuV0wqK2ZdI8VLV0XlpZh6Zl0TF9prDtevC8zqxBd3ROTuuwu5P1fnq0p8eOo2x2ls6PXfMMNiVZnVJn97mews+JiCozmw+U3W7qmWG1oZ+1BG+Dxb7an2xD3NUG2+eesknC5eFk9ERnuQnKedzuJ3bwvFSFg3bqIk3M3aizXB/4dWqG3ToNNfvcAzY5OpJs9u+fS9NwdG8elWu/olYwmcx9S0/Y2ejpsV8ZCw25hSUMyODUWScsApWh2DSUrf2yJ53P/LMCNTEaGh2DP5Ty4fC8TPYHMWehVNqLJYsJm33GMm8u8zJ3T5aV+6V41g4REYXQPXZ7edKnebKo/PWG9KLCzJcD7diOqNRVrdlpne6WkXL4nAn33o56uoueA4Vlh9kig5tRubFdkcj6TOgWo149m0SdtiNnp9ViH+s1TuJnYehOxhgb5blYh3xfxl7KQ1crcx+2BYLXwzb87OAT81bePV+tsBHFg0Ic+6t8Jp89iNzZrK/7WZAfj5LaQ0aaqTPQr9FG5Plzd3g68dPV9NkOZ4Iir3qrWAoiWC06o8hDsTZtC8oJOF1N2PQiPx2MjdkchGdX422Jre6PPBHMx0duG2yK6q8ViZOAtaJie/ct30ksyrLQv3J++MJ56o+mArBV+TI3XSrCRqOdsqvZSnqc2N2DkXXd+3zT9nukWAJTbev8Yd65l+dcEe7iIP0mWONQpYw8XRThdi3LgCUPXJtty5fr/XTRiKd9UNXXzKIXFXjgfr0lalgKmi5GT0ND16f2470UBat7nieyKIudsCN0Vr2VHK7kgPCxFPUFMbrvC33x5j009KVhqfDVvR+KsdyV5Y7ck0VJuu91hFAiYkCC1X1P6vaIKAX3Ytx5H3zwNFSh/biweLawhCFE8cxOlRHEM2Qhf2byGoLXNZ4NM2FmIahiFYxMx3d9XpMsNFN8nmI0AqYuemeAlTHKZCEUfZ5sddkeZSIcJygUoRLzEDqoXIRCOQsm/sbONAjRYW5STYl5/xliDMyMTkxbwxBpUswfU52XS1+L60goR8D1N6EDJGucbOxMeDbdeIlV3LUx9AkSVGwDNxgDw3ZLJT6Ul7XON2uZ5tp4BmMe5w6CDsKaClWNj7f6ydpoCZaSyh7zMsFl1+SBgngqQU3zrYztnYwW8RYYw2vOsyFCmuqLsYZUTb3aOv3RZWxmGjBzpXKw5lkY6N45WThOCRCmOckVaCCg6MJsoW/jKRwpR8/VzvFmPffwbIMzXQRUl/0sOUKEjgE6Yke9l/TRDJINPgdiWehSebQndII2iYSot1+IYKY702O0UTDBpe3xx0AXIgnj8mQeCh6M4NaTirPt0k6ogS4WsI8EJTczugjGsWJMNBbR0tKd/tZz4IlMsGUP2TnMfNVyWEeXoso7a3Mf452+BbWuxeWQYt4ZzSZQ8EeQxsAWtb2fwcrR8AjmeGFN4jly4rE9gWdLBYHjgG1MY8fSygBknU7MxwedaoFjT2XvnAihqzzreDBHql87qt7xx1pgq0LiaDSFtgIsFzq6CqZWrkiQpwcvp7sQUxQO2RnmWAxHcI/HwolMij1xk26kQhFnwjLKtFlolp1QrKWIYoYnOINjrCFhNrTFWNEREzwkWHiCE8tVYHieZaHkH+fnwRFuvbOJOieMgBLzWDEdzcCqMIZuPEWYqkPqW7raH5qUajArJN/2PV3KDv64X0dWf+5Rv/QyWsYi3CFhUIFMGBpqrOgYZ5YbQwcJQw9pY2sTU0DXZ2IrWSge5r/hq7z6QjfWzLQvIeQDEwlD0/E6H9+r41eOmutSgXkpApFSi4/kUCsXUTY92Y4QBKp2tFSqE+eY2BJ1IjuS4JkObTxDMAcHJ0e8PplKUICSx8Mi3q4FiMDe0rR0uD1Wsa14APU9n4eiMwHDaNwfW5OZqKtsaTlHGwh4rrveAYzrvUVp7kyiKhyXCE/0veGWh3CTWHh7ZNEE7SEvLG0bzZEzm6AhM4INDqIz3kLedwO1I9n2VEAOw8ZoNg8nCbUyrUZuMjXF4wiNcQdlAHi2JgN3IOGxnBsjZWHRmCdYMQ2z5JEYAzMfSABjy3fueYBQB6nlycoH52BC90CbdQw8g1BkJ+IAy3LjrZklYiAlwNr6u0jUJcfqi8ChAtwkjKhCd7gBvJcV8pwvZYg0wZoURy+LhQgBby5pc4Qhiod9GJ69U5zFrocyGQn+wqN6x8OJbp5nBsi1TeDMjtEGdfwNVK3MnFs5qG3rXoomQI422h64kPey2Q7QTDBdvT9MXzQZIlmdqkBDFM5gRkcmhtqLlvPz95ViYlj2Y3CoLwWsLGpStYo63KU0bhXV+r3xYDSCqmU9Cj2xJQmtbqclCDcbx4BzFT5Z1uJprnrW0wCCx6DKH4JD/VCTqCKs3gZ5sCbVw65ukqBmTeGhL0k9WRT6vX6/f7N6CCtyuPaqzZ6GCKG3/S2kWEM4XdpTAzzpAzAY38rcAIz+/8HqXVhHVVpeuvrmzaUZFdttkMfNzPRo0X+N71m2ql/hAgNdfaxZsE7zdZMcGanygDYPRZWRqm79XixHU/jYJixq32yar06vAdUhVG3r61lVMFoaU2A/Ibh4TBgr64d2+9vDtr4ethVsg3OR33Jpv21FPgr53USLFVv6cYfyt6zYpP9zGwSUFgcSP8XFNkjzmnvk/sbdMRJs35787r+4u2QXti6/7Pv5F9S+X+JeI0QB98jdfZx1FDSjirVKcmm9btm9bPhP5/eH5fHbD8h/5il4bNYJofSFm7/1Fvy3dpjm7TCok0ZNGNcku4Ir05KsgpQ26mJXReTjzrNBoqTg7izCWJqvufpUM7LlkqJml1dk667R+IGzCONYQr5bbLx+ixjlasKar2Pux3dX5E8FxYsOhBc40rxmQR4RjhUcnIAXOCBZpzUj1RWTrxaHlCVXm0Z7V1dtWkQBvWYSHGru27vJrQlrvkw19wHdEe6/L7fydSqNuR9/+Uca94X7lds8c82Ku2tZVz+LVWm+vuN+fjndWzl7ugV+uslZa1MXeePV/f+yvPudm3G/clfEqy3XXP3eBBofSe7t/xSu2Qx2rPgzEWdESlqcuEu94lZFxb1WgStpbosXyrxqBTcccBGpWLpKo4CRViMMatLtcM2Ya3I//fQT9+Mv715hX7ifuR9/eVs2vrwRnN8Kk5ETF+Txt7H+EJJ+UOj/IS9fULlW9W9p+PeFu48tXzj2FaHvoXhxaGbkdIXj3cZRxf7FjV9xfkPy707z5+PrtY5dlPsD1l6Uf1e+MWn8wNnGyPiPbRKcYpL/5wPnEC4nJL4oZFTke1JdakVaX8YjYHE0uCjlISE5dyAcDXZ5lLQaUcCuDL97g/StofzyFv1L/fhyx/3889sU/kQQv5bVXXnDlatJtU8jcsN3WZEyqAj3vo3495qryLZg5L3b9SLXRZQRVrcaLwX5Un1JHoSUcM1mXhy+7vayxa0b/et7WB/uezz/HZjN5qfG/wYAAP//jvFRA0MXAAA=" -> (known after apply)
        # (8 unchanged attributes hidden)



        # (4 unchanged blocks hidden)
    }

  # aws_launch_template.worker_internal_x86 will be updated in-place
  ~ resource "aws_launch_template" "worker_internal_x86" {
      ~ default_version         = 9 -> (known after apply)
        id                      = "lt-0aae9d85fdd3f7067"
      ~ latest_version          = 9 -> (known after apply)
        name                    = "imagebuilder_worker_internal_x86_staging"
        tags                    = {
            "AppCode"      = "IMGB-001"
            "Name"         = "🔧 Internal Composer Worker (staging)"
            "ServiceOwner" = "Image Builder"
        }
      ~ user_data               = "H4sIAAAAAAAA/9RY2XLjOJZ9V0T+A8dVETMTOZK4iJLlLle0KJFaCYogAS49Ew4ukEgRImkSWqvy3ycky9lOp2u6erpeyk8GcDceH5x74WGRM5Kzpn0qyQO33VGWlkHF2tv0SOK/cGGxy+OgOj3e6VNdVQwERgPo3TUuqyYmVZ0W+QMntPhPjU+NZvOt0afGa+xRWpdFnbKrbcBYECVbkrO/cKuUkjzYkse7NE9ZK1qt7/7uZVdBXq9I1VTzqIjTfP3A9cKUvTG4lszIkbUjWuziZlTkq3T9qaGnW/JdcT+8tWk0djWp6ocGxzW5SwUPHInE5mWzwXEcV9fJU7BjSVGlZxI/ZeR0tb38NLm7uk6aVR1wg8FgoEjgHAyFUySql+VoYA6UwWAwHJjD42alTad0vBrm/TSik9PWqVSlspFIF12WWWNbIGUvHi7PB2HjdZ08MenS1UuyrFJwBC4d30eO0W9DrVRi/tzXDuD0OVutk/5qdwJepz/9rAdd42RjZS0noNCOK+iO5XTCorZl0jxUtXReWlmHpmXRMX2msO168LzOrEF3dE5O67C7k/V+erSnx46jbHaWzo9d8ww2JVmdUmf3uZ7Cz4mIKjObD5TdbuqZYbWhn7UEb4PFvtqfbEPc1Qbb556yScLl4WT0RGe5Ccp53O4ndvC8VIWDduoiTczdqLNcH/h1aobdOg01+9wDNjk6kmz2759L03B0bx6Va7+iVjCZzH1LT9jZ6OmxXxkLDbmFJQzI4NRZJywClaHYNJSt/bInnc/8swI1MRoaHYM/lPLh8LxM9gcxZ6FU2osliwmbfcYyby7zMndPlpX7pXjWDhERhdA9dnt50qd5sqj89Yb0osLMlwPt2I6o1FWt2Wmd7paRcvicCffejnq6i54DhWWH2SKDm1G5sV2RyPpM6BajXj2bRJ22I2en1WIf6zVO4mdh6E7GGBvluViHfF/GXspDVytzH7YFgtfDNvzs4BPzVt49X62wEcWDQhz7q3wmnz2I3Nmsr/tZkB+PktpDRpqpM9Cv0Ubk+XN3eDrx09X02Q5ngiKveqtYCiJYLTqjyEOxNm0Lygk4XU3Y9CI/HYyN2RyEZ1fjbYmt7o88EczHR24bbIrqrxWJk4C1omJ79y3fSSzKstC/cn74wnnqj6YCsFX5sjddKsJGo52yq9lKepzY3YORdd37fNP2e6RYAlNt6/xh3rmX51wR7uIg/SZZ41CljDxdFOF2LcuAJQ9cm23Ll+v9dNGIp31Q1dfKohcVeOB+vRVqWAqaLkZPQ0PXp/bjvRQFq3ueJ7Ioi52wI3RWvZUcruSA8LEU9QUxuu8LffHmPTT0pWGp8NW9H4qx3JXljtyTRUm673WEUCJiQILVfU/q9ogoBfdi3HmffPA0VKH9uLB4trCEIUTxzE6VEcQzZCF/ZvIagtczng0zYWYhqGIVjEzHd31ekyw0U3yeYjQCpi56Z4CVMcpkIRR9nmx12R5lIhwnKBShEvMQOqhchEI5Cyb+xs40CNFhblJNiXn/GWIMzIxOTFvDEGlSzB9TnZdLX4vrSChHwPU3oQMka5xs7Ex4Nt14iVXctTH0CRJUbAM3GAPDdkslPpSXs843Z5nm2ngGYx7nDoIOwpoKVY2Pt/rJ2mgJlpLKHvMywWXX5IGCeCpBTfOtjO2djBbxFhjDa82zIUKa6ouxhlRNvdo6/dFlbWYaMHOlcrDmWRjo3jlZOE4JEKY5yRVoIKDowmyhb+MpHClHz9XO8WY99/BsgzNdBFSX/Sw5QoSOATpiR72X9NEMkg0+B2JZ6FJ5tCd0gjaJhKi3X4hgpjvTY7RRMMGl7fHHQBciCePyZB4KHozg1pOKs+3STqiBLhawjwQlNzO6CMaxYkw0FtHS0p3+1nPgiUywZQ/ZOcx81XJYR5eiyjtrcx/jnb4Fta7F5ZBi3hnNJlDwR5DGwBa1vZ/BytHwCOZ4YU3iOXLisT2BZ0sFgeOAbUxjx9LKAGSdTszHB51qgWNPZe+cCKGrPOt4MEeqXzuq3vHHWmCrQuJoNIW2AiwXOroKplauSJCnBy+nuxBTFA7ZGeZYDEdwj8fCiUyKPXGTbqRCEWfCMsq0WWiWnVCspYhihic4g2OsIWE2tMVY0RETPCRYeIITy1VgeJ5loeQf5+fBEW69s4k6J4yAEvNYMR3NwKowhm48RZiqQ+pbutofmpRqMCsk3/Y9XcoO/rhfR1Z/7lG/9DJaxiLcIWFQgUwYGmqs6BhnlhtDBwlDD2ljaxNTQNdnYitZKB7mv+GrvPpCN9bMtC8h5AMTCUPT8Tof36vjV46a61KBeSkCkVKLj+RQKxdRNj3ZjhAEqna0VKoT55jYEnUiO5LgmQ5tPEMwBwcnR7w+mUpQgJLHwyLergWIwN7StHS4PVaxrXgA9T2fh6IzAcNo3B9bk5moq2xpOUcbCHiuu94BjOu9RWnuTKIqHJcIT/S94ZaHcJNYeHtk0QTtIS8sbRvNkTOboCEzgg0OojPeQt53A7Uj2fZUQA7Dxmg2DycJtTKtRm4yNcXjCI1xB2UAeLYmA3cg4bGcGyNlYdGYJ1gxDbPkkRgDMx9IAGPLd+55gFAHqeXJygfnYEL3QJt1DDyDUGQn4gDLcuOtmSViICXA2vq7SNQlx+qLwKEC3CSMqEJ3uAG8lxXynC9liDTBmhRHL4uFCAFvLmlzhCGKh30Ynr1TnMWuhzIZCf7Co3rHw4lunmcGyLVN4MyO0QZ1/A1UrcycWzmobeteiiZAjjbaHriQ97LZDtBMMF29P0xfNBkiWZ2qQEMUzmBGRyaG2ouW8/P3nWJiWPZjcKgvDawsalK1ijrcpTRuFdX6vfFgNIKqZT0KfEviW8J9SxBuJo4B5yp8sqzF01z1rKcBBI9BlT8Eh/qhJlFFWL0N8mBNqodd3SRBzZrCQ1+SerIo9Hv9fv9m9RBW5HAdVZs9DRFCb/EtpFhDOF3aUwM86QMwGN+63ACM/v/J6l1YR1VaXob65s2lGRXbbZDHzcz0aNF/ze9Ztqpf0QIDXX2sWbBO83UzzRmp8oA2D0WVkapu/V4oR1P42CYsat9smq9OrwnVIVRt6+u3qmC0NKbAfkJw8ZgwVtYP7fa+jEiTjwVJkDsS35U7/VCI4mb/fKx6Z3nf+haM1lcwWhfHVrANzkV+K7j9dlz5qK7vNlqs2NKPp5i/ZcUm/Z/bIqC0OJD4KS62QZrX3CP3N+6OkWD7Fp67/+Lukl3Yuvz53++/QPv9EfeaIQq4R+7u46qjoBlVrFWSy3h2q+4l4D9d3x9Wx28/Mv+Z5+KxWSeE0hcC/9Z78d/aYZq3w6BOGjVhXJPsCq5MS7IKUtqoi10VkY+n0waJkoK7swhjab7m6lPNyJZLippdXpqtu0bjB84ijGMJ+e6w8fpbxChXE9Z8XXM/vrtHfyooXsQivMCR5jUL8ohwrODgBLzAAck6rRmprph8tTikLLnaNNq7umrTIgrotZLgUHPfXlBuTVjzZau5D+iOcP99uZWvW2nM/fjLPxLCL9yv3OaZa1bcXcu6+lmsSvP1Hffzy9e91bynW+Knm+a1NnWRN17d/y/Lu98ZjPuVuyJebbnm6vcW0PhIl2//c+GazWDHij8TcUakpMWJuzQ1blVU3GuruJLmdnihzKtWcMMBF5GKpas0ChhpNcKgJt0O14y5JvfTTz9xP/7y7qX2hfuZ+/GXt73lyxvB+a00GTlxQR5/m+sPIekH08A/5OULKtfW/y0N/35w97HlC8e+IvQ9FC8OzYycrnC8CxxV7F8M/IrzG5J/9zV/Pr5e+9hFuT9g7UX5d+Ubk8YPnG2MjP/YJsEpJvl/PnAO4XJC4otCRkW+J9WlV6T1ZT0CFkeDi1IeEpJzB8LRYJdHSasRBezK8Ls3SN+Gzi9v0b/0jy933M8/vy3hTwTxa1vdlTdcuZpU+zQiN3yXFSmDinDvx4h/r7mKbAtG3rtdL3JdRBlhdavx0pAv3ZfkQUgJ12zmxeFrtJcQt5H1r+9hfbjv8fx3YDabnxr/GwAA//8rky76ZxcAAA==" -> (known after apply)
        # (8 unchanged attributes hidden)



        # (4 unchanged blocks hidden)
    }

  # aws_spot_fleet_request.workers_external_x86 must be replaced
-/+ resource "aws_spot_fleet_request" "workers_external_x86" {
      ~ client_token                        = "terraform-20210118205529763600000002" -> (known after apply)
      ~ id                                  = "sfr-00e9d025-f57f-4188-84e0-835169aacec0" -> (known after apply)
      ~ load_balancers                      = [] -> (known after apply)
      ~ spot_request_state                  = "active" -> (known after apply)
        tags                                = {
            "AppCode"      = "IMGB-001"
            "Name"         = "External worker fleet - staging"
            "ServiceOwner" = "Image Builder"
        }
      ~ target_group_arns                   = [] -> (known after apply)
        # (10 unchanged attributes hidden)

      - launch_template_config { # forces replacement
          - launch_template_specification {
              - id      = "lt-04e6df10bd74694e7" -> null
              - version = "9" -> null
            }

          - overrides {
              - instance_type     = "c5.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
        }
      + launch_template_config { # forces replacement
          + launch_template_specification {
              + id      = "lt-04e6df10bd74694e7"
              + version = (known after apply)
            }

          + overrides {
              + instance_type     = "c5.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
        }
    }

  # aws_spot_fleet_request.workers_internal_x86 must be replaced
-/+ resource "aws_spot_fleet_request" "workers_internal_x86" {
      ~ client_token                        = "terraform-20210118204241003500000003" -> (known after apply)
      ~ id                                  = "sfr-3ffc1651-26ac-4b37-a956-3bd24643f4dc" -> (known after apply)
      ~ load_balancers                      = [] -> (known after apply)
      ~ spot_request_state                  = "active" -> (known after apply)
        tags                                = {
            "AppCode"      = "IMGB-001"
            "Name"         = "Image Builder internal worker fleet - staging"
            "ServiceOwner" = "Image Builder"
        }
      ~ target_group_arns                   = [] -> (known after apply)
        # (10 unchanged attributes hidden)

      - launch_template_config { # forces replacement
          - launch_template_specification {
              - id      = "lt-0aae9d85fdd3f7067" -> null
              - version = "9" -> null
            }

          - overrides {
              - instance_type     = "c5.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
        }
      + launch_template_config { # forces replacement
          + launch_template_specification {
              + id      = "lt-0aae9d85fdd3f7067"
              + version = (known after apply)
            }

          + overrides {
              + instance_type     = "c5.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
        }
    }

  # aws_volume_attachment.composer_external must be replaced
-/+ resource "aws_volume_attachment" "composer_external" {
      ~ id          = "vai-4047416848" -> (known after apply)
      ~ instance_id = "i-006c1b00085972e8d" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # aws_volume_attachment.composer_internal must be replaced
-/+ resource "aws_volume_attachment" "composer_internal" {
      ~ id          = "vai-3224493979" -> (known after apply)
      ~ instance_id = "i-04fa20b9e3f3d85d1" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

Plan: 6 to add, 2 to change, 6 to destroy.
```

</details>

*Pusher: @major, Action: `pull_request`*